<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>9.8. Using -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-union.html" title="9.7. Union" /><link rel="next" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="9.8. Using" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-71248";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>9.8. Using</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-union.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-general.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-read.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-using"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">9.8. Using</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-using.html#using-query-using-an-index-hint">Query using an index hint</a></span></li><li><span class="section"><a href="query-using.html#using-query-using-multiple-index-hints">Query using multiple index hints</a></span></li><li><span class="section"><a href="query-using.html#using-hinting-a-label-scan">Hinting a label scan</a></span></li></ul></div>

<p>If you do not specify an explicit <code class="literal">START</code> clause, Cypher needs to infer where in the graph to start your query.
This is done by looking at the <code class="literal">WHERE</code> clause and the <code class="literal">MATCH</code> clause and using that information to find a useful index.</p>
<p>This index might not be the best choice though — sometimes multiple indexes could be used, and Cypher has picked the wrong one (from a performance point of view).</p>
<p>You can force Cypher to use a specific starting point by using the <code class="literal">USING</code> clause.
This is called giving Cypher an index hint.</p>
<p>If your query matches large parts of an index, it might be faster to scan the label and filter out nodes that do not match.
To do this, you can use <code class="literal">USING</code> <code class="literal">SCAN</code>.
It will force Cypher to not use an index that could have been used, and instead do a label scan.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>You cannot use index hints if your query has a <code class="literal">START</code> clause.</p></td></tr></table></div>
<section class="section" id="using-query-using-an-index-hint"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Query using an index hint</h3></div></div></div>

<p>To query using an index hint, use <code class="literal">USING</code> <code class="literal">INDEX</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n:Swedish)
USING INDEX n:Swedish(surname)
WHERE n.surname = 'Taylor'
RETURN n</pre><p>
</p>
<p>The query result is returned as usual.</p>
<div class="queryresult table" id="d5e6398"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[3]{name:"Andres",age:36,awesome:true,surname:"Taylor"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Swedish`(`surname`)
create (_0 {`name`:"Emil"})
create (_1:`German` {`name`:"Stefan", `surname`:"Plantikow"})
create (_2 {`age`:34, `name`:"Peter"})
create (_3:`Swedish` {`age`:36, `awesome`:true, `name`:"Andres", `surname`:"Taylor"})
create _0-[:`KNOWS`]-&gt;_2
create _1-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (n:Swedish) using index n:Swedish(surname) where n.surname = 'Taylor' return n</strong></span></p>
</section>
<section class="section" id="using-query-using-multiple-index-hints"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Query using multiple index hints</h3></div></div></div>

<p>To query using multiple index hints, use <code class="literal">USING</code> <code class="literal">INDEX</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (m:German)--&gt;(n:Swedish)
USING INDEX m:German(surname)
USING INDEX n:Swedish(surname)
WHERE m.surname = 'Plantikow' AND n.surname = 'Taylor'
RETURN m</pre><p>
</p>
<p>The query result is returned as usual.</p>
<div class="queryresult table" id="d5e6428"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>m</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Stefan",surname:"Plantikow"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`German`(`surname`)
create index on :`Swedish`(`surname`)
create (_0 {`name`:"Emil"})
create (_1:`German` {`name`:"Stefan", `surname`:"Plantikow"})
create (_2 {`age`:34, `name`:"Peter"})
create (_3:`Swedish` {`age`:36, `awesome`:true, `name`:"Andres", `surname`:"Taylor"})
create _0-[:`KNOWS`]-&gt;_2
create _1-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (m:German)--&gt;(n:Swedish) using index m:German(surname) using index n:Swedish(surname) where m.surname = 'Plantikow' and n.surname = 'Taylor' return m</strong></span></p>
</section>
<section class="section" id="using-hinting-a-label-scan"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Hinting a label scan</h3></div></div></div>

<p>If the best performance is to be had by scanning all nodes in a label and then filtering on that set, use <code class="literal">USING</code> <code class="literal">SCAN</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (m:German)
USING SCAN m:German
WHERE m.surname = 'Plantikow'
RETURN m</pre><p>
</p>
<p>This query does its work by finding all <code class="literal">:German</code> labeled nodes and filtering them by the surname property.</p>
<div class="queryresult table" id="d5e6459"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>m</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Stefan",surname:"Plantikow"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"Emil"})
create (_1:`German` {`name`:"Stefan", `surname`:"Plantikow"})
create (_2 {`age`:34, `name`:"Peter"})
create (_3:`Swedish` {`age`:36, `awesome`:true, `name`:"Andres", `surname`:"Taylor"})
create _0-[:`KNOWS`]-&gt;_2
create _1-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (m:German) using scan m:German where m.surname = 'Plantikow' return m</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>