<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>11.7. Create Unique -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-foreach.html" title="11.6. Foreach" /><link rel="next" href="cypherdoc-importing-csv-files-with-cypher.html" title="11.8. Importing CSV files with Cypher" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="11.7. Create Unique" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-71248";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>11.7. Create Unique</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-foreach.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-write.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypherdoc-importing-csv-files-with-cypher.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-create-unique"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">11.7. Create Unique</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-create-unique.html#_introduction_5">Introduction</a></span></li><li><span class="section"><a href="query-create-unique.html#_create_unique_nodes">Create unique nodes</a></span></li><li><span class="section"><a href="query-create-unique.html#_create_unique_relationships">Create unique relationships</a></span></li><li><span class="section"><a href="query-create-unique.html#create-unique-describe-complex-pattern">Describe complex pattern</a></span></li></ul></div>

<section class="section" id="_introduction_5"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Introduction</h3></div></div></div>

<div class="admonitionblock Tip"><table><tr><td class="icon"><img alt="[Tip]" src="images/icons/admon/tip.svg" /></td><td class="content"><b>Tip</b><p><code class="literal"><a class="link" href="query-merge.html" title="11.2. Merge">MERGE</a></code> might be what you want to use instead of <code class="literal">CREATE UNIQUE</code>.
Note however, that <code class="literal">MERGE</code> doesn’t give as strong guarantees for relationships being unique.</p></td></tr></table></div>
<p><code class="literal">CREATE UNIQUE</code> is in the middle of <code class="literal">MATCH</code> and <code class="literal">CREATE</code> — it will match what it can, and create what is missing.
<code class="literal">CREATE UNIQUE</code> will always make the least change possible to the graph — if it can use parts of the existing graph, it will.</p>
<p>Another difference to <code class="literal">MATCH</code> is that <code class="literal">CREATE UNIQUE</code> assumes the pattern to be unique.
If multiple matching subgraphs are found an error will be generated.</p>
<div class="admonitionblock Tip"><table><tr><td class="icon"><img alt="[Tip]" src="images/icons/admon/tip.svg" /></td><td class="content"><b>Tip</b><p>In the <code class="literal">CREATE UNIQUE</code> clause, patterns are used a lot.
Read <a class="xref" href="introduction-pattern.html" title="8.8. Patterns">Section 8.8, “Patterns”</a> for an introduction.</p></td></tr></table></div>
<p>The examples start out with the following data set:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypher-createunique-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-createunique-graph.svg" alt="cypher-createunique-graph.svg" /></span>
</a>
</div>
</section>
<section class="section" id="_create_unique_nodes"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Create unique nodes</h3></div></div></div>

<section class="section" id="create-unique-create-node-if-missing"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Create node if missing</h4></div></div></div>

<p>If the pattern described needs a node, and it can’t be matched, a new node will be created.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:LOVES]-(someone)
RETURN someone</pre><p>
</p>
<p>The root node doesn’t have any <code class="literal">LOVES</code> relationships, and so a node is created, and also a relationship to that node.</p>
<div class="queryresult table" id="d5e10298"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>someone</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Relationships created: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (root {name: 'root'}) create unique (root)-[:LOVES]-(someone) return someone</strong></span></p>
</section>
<section class="section" id="create-unique-create-nodes-with-values"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Create nodes with values</h4></div></div></div>

<p>The pattern described can also contain values on the node. These are given using the following syntax: <code class="literal">prop : &lt;expression&gt;</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:X]-(leaf { name:'D' })
RETURN leaf</pre><p>
</p>
<p>No node connected with the root node has the name <code class="literal">D</code>, and so a new node is created to match the pattern.</p>
<div class="queryresult table" id="d5e10332"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>leaf</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Relationships created: 1
</th></tr><tr><th>Properties set: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{name:"D"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (root {name: 'root'}) create unique (root)-[:X]-(leaf {name:'D'} ) return leaf</strong></span></p>
</section>
<section class="section" id="create-unique-create-labeled-node-if-missing"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Create labeled node if missing</h4></div></div></div>

<p>If the pattern described needs a labeled node and there is none with the given labels, Cypher will create a new one.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a { name: 'A' })
CREATE UNIQUE (a)-[:KNOWS]-(c:blue)
RETURN c</pre><p>
</p>
<p>The A node is connected in a <code class="literal">KNOWS</code> relationship to the c node, but since C doesn’t have the <code class="literal">:blue</code> label, a new node labeled as <code class="literal">:blue</code> is created along with a <code class="literal">KNOWS</code> relationship from A to it.</p>
<div class="queryresult table" id="d5e10370"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>c</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Relationships created: 1
</th></tr><tr><th>Labels added: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (a {name: 'A'}) create unique (a)-[:KNOWS]-(c:blue) return c</strong></span></p>
</section>
</section>
<section class="section" id="_create_unique_relationships"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Create unique relationships</h3></div></div></div>

<section class="section" id="create-unique-create-relationship-if-it-is-missing"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Create relationship if it is missing</h4></div></div></div>

<p><code class="literal">CREATE UNIQUE</code> is used to describe the pattern that should be found or created.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (lft { name: 'A' }),(rgt)
WHERE rgt.name IN ['B', 'C']
CREATE UNIQUE (lft)-[r:KNOWS]-&gt;(rgt)
RETURN r</pre><p>
</p>
<p>The left node is matched agains the two right nodes. One relationship already exists and can be matched, and the other relationship is created before it is returned.</p>
<div class="queryresult table" id="d5e10407"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>2 rows
</th></tr><tr><th>Relationships created: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">:KNOWS[4]{}</code></p></td></tr><tr><td><p><code class="literal">:KNOWS[3]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (lft {name: 'A'}), (rgt) where rgt.name in ['B','C'] create unique (lft)-[r:KNOWS]-&gt;(rgt) return r</strong></span></p>
</section>
<section class="section" id="create-unique-create-relationship-with-values"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Create relationship with values</h4></div></div></div>

<p>Relationships to be created can also be matched on values.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[r:X { since:'forever' }]-()
RETURN r</pre><p>
</p>
<p>In this example, we want the relationship to have a value, and since no such relationship can be found, a new node and relationship are created. Note that since we are not interested in the created node, we don’t name it.</p>
<div class="queryresult table" id="d5e10441"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Relationships created: 1
</th></tr><tr><th>Properties set: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">:X[4]{since:"forever"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (root {name: 'root'}) create unique (root)-[r:X {since:'forever'}]-() return r</strong></span></p>
</section>
</section>
<section class="section" id="create-unique-describe-complex-pattern"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Describe complex pattern</h3></div></div></div>

<p>The pattern described by <code class="literal">CREATE UNIQUE</code> can be separated by commas, just like in <code class="literal">MATCH</code> and <code class="literal">CREATE</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:FOO]-&gt;(x),(root)-[:BAR]-&gt;(x)
RETURN x</pre><p>
</p>
<p>This example pattern uses two paths, separated by a comma.</p>
<div class="queryresult table" id="d5e10478"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>x</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Relationships created: 2</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`name`:"A"})
create (_1 {`name`:"root"})
create (_2 {`name`:"B"})
create (_3 {`name`:"C"})
create _0-[:`KNOWS`]-&gt;_3
create _1-[:`X`]-&gt;_3
create _1-[:`X`]-&gt;_2
create _1-[:`X`]-&gt;_0
</span><span class="command"><strong>
 match (root {name: 'root'}) create unique (root)-[:FOO]-&gt;(x), (root)-[:BAR]-&gt;(x) return x</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>