<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>11.5. Remove -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-delete.html" title="11.4. Delete" /><link rel="next" href="query-foreach.html" title="11.6. Foreach" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="11.5. Remove" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-71248";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>11.5. Remove</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-delete.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-write.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-foreach.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-remove"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">11.5. Remove</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-remove.html#remove-remove-a-property">Remove a property</a></span></li><li><span class="section"><a href="query-remove.html#remove-remove-a-label-from-a-node">Remove a label from a node</a></span></li><li><span class="section"><a href="query-remove.html#remove-removing-multiple-labels">Removing multiple labels</a></span></li></ul></div>

<p>Removing properties and labels from graph elements is done using <code class="literal">REMOVE</code>.</p>
<p>For deleting nodes and relationships, see <a class="xref" href="query-delete.html" title="11.4. Delete">Section 11.4, “Delete”</a>.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>Removing labels from a node is an idempotent operation:
If you try to remove a label from a node that does not have that label on it, nothing happens.
The query statistics will tell you if something needed to be done or not.</p></td></tr></table></div>
<p>The examples start out with the following database:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypher-remove-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-remove-graph.svg" alt="cypher-remove-graph.svg" /></span>
</a>
</div>
<section class="section" id="remove-remove-a-property"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Remove a property</h3></div></div></div>

<p>Neo4j doesn’t allow storing <code class="literal">null</code> in properties. Instead, if no value exists, the property is just not there. So, to remove a property value on a node or a relationship, is also done with <code class="literal">REMOVE</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (andres { name: 'Andres' })
REMOVE andres.age
RETURN andres</pre><p>
</p>
<p>The node is returned, and no property <code class="literal">age</code> exists on it.</p>
<div class="queryresult table" id="d5e10122"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>andres</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Properties set: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[2]{name:"Andres"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0:`Swedish` {`age`:25, `name`:"Tobias"})
create (_1:`Swedish`:`German` {`age`:34, `name`:"Peter"})
create (_2:`Swedish` {`age`:36, `name`:"Andres"})
create _2-[:`KNOWS`]-&gt;_1
create _2-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match (andres {name: 'Andres'}) remove andres.age return andres</strong></span></p>
</section>
<section class="section" id="remove-remove-a-label-from-a-node"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Remove a label from a node</h3></div></div></div>

<p>To remove labels, you use <code class="literal">REMOVE</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: 'Peter' })
REMOVE n:German
RETURN n</pre><p>
</p>
<div class="queryresult table" id="d5e10152"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Labels removed: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0:`Swedish` {`age`:25, `name`:"Tobias"})
create (_1:`Swedish`:`German` {`age`:34, `name`:"Peter"})
create (_2:`Swedish` {`age`:36, `name`:"Andres"})
create _2-[:`KNOWS`]-&gt;_1
create _2-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match (n {name: 'Peter'}) remove n:German return n</strong></span></p>
</section>
<section class="section" id="remove-removing-multiple-labels"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Removing multiple labels</h3></div></div></div>

<p>To remove multiple labels, you use <code class="literal">REMOVE</code>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: 'Peter' })
REMOVE n:German:Swedish
RETURN n</pre><p>
</p>
<div class="queryresult table" id="d5e10182"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Labels removed: 2</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0:`Swedish` {`age`:25, `name`:"Tobias"})
create (_1:`Swedish`:`German` {`age`:34, `name`:"Peter"})
create (_2:`Swedish` {`age`:36, `name`:"Andres"})
create _2-[:`KNOWS`]-&gt;_1
create _2-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match (n {name: 'Peter'}) remove n:German:Swedish return n</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>