<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>3.9. Cypher vs. SQL -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypherdoc-loading-data.html" title="3.8. Loading Data" /><link rel="next" href="cypher-intro-applications.html" title="Chapter 4. Use Cypher in an application" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="3.9. Cypher vs. SQL" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-76183";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>3.9. Cypher vs. SQL</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypherdoc-loading-data.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="cypher-getting-started.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypher-intro-applications.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-cypher-vs-sql"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">3.9. Cypher vs. SQL</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="cypherdoc-cypher-vs-sql.html#_data_model">Data Model</a></span></li><li><span class="section"><a href="cypherdoc-cypher-vs-sql.html#_sample_data">Sample Data</a></span></li><li><span class="section"><a href="cypherdoc-cypher-vs-sql.html#_simple_read_of_data">Simple read of data</a></span></li><li><span class="section"><a href="cypherdoc-cypher-vs-sql.html#_join">Join</a></span></li><li><span class="section"><a href="cypherdoc-cypher-vs-sql.html#_aggregation">Aggregation</a></span></li></ul></div>

<p>If you have used <code class="literal">SQL</code> and want to learn Cypher, this chapter is for you!
We won’t dig very deep into either of the languages, but focus on bridging the gap.</p>
<section class="section" id="_data_model"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Data Model</h3></div></div></div>

<p>For our example, we will use data about persons who <span class="emphasis"><em>act in, direct, produce</em></span> movies.</p>
<p>Here’s an entity-relationship model for the example:</p>
<div class="informalfigure">
<a class="ulink" href="images/sql-cypher-moviedb-er-diagram.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/sql-cypher-moviedb-er-diagram.svg" alt="sql-cypher-moviedb-er-diagram.svg" /></span>
</a>
</div>
<p>We have <code class="literal">Person</code> and <code class="literal">Movie</code> entities, which are related in three different ways, each of which have many-to-many cardinality.</p>
<p>In a RDBMS we would use tables for the entities as well as for the associative entities (join tables) needed.
In this case we decided to go with the following tables:
<code class="literal">movie</code>, <code class="literal">person</code>, <code class="literal">acted_in</code>, <code class="literal">directed</code>, <code class="literal">produced</code>.
You’ll find the SQL for this below.</p>
<p>In Neo4j, the basic data units are nodes and relationships.
Both can have properties, which correspond to attributes in a RDBMS.</p>
<p>Nodes can be grouped by putting labels on them.
In the example, we will use the labels <code class="literal">Movie</code> and <code class="literal">Person</code>.</p>
<p>When using Neo4j, related entities can be represented directly by using relationships.
There’s no need to deal with foreign keys to handle the relationships, the database will take care of such mechanics.
Also, the relationships always have full referential integrity.
There’s no constraints to enable for this, as it’s not optional; it’s really part of the underlying data model.
Relationships always have a type, and we will differentiate the different kinds of relationships by using the types <code class="literal">ACTED_IN</code>, <code class="literal">DIRECTED</code>, <code class="literal">PRODUCED</code>.</p>
</section>
<section class="section" id="_sample_data"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Sample Data</h3></div></div></div>

<p>First off, let’s see how to set up our example data in a RDBMS.
We’ll start out creating a few tables and then go on to populate them.</p>
<pre class="programlisting" data-lang="sql">CREATE TABLE movie (
  id INTEGER,
  title VARCHAR(100),
  released INTEGER,
  tagline VARCHAR(100)
);
CREATE TABLE person (
  id INTEGER,
  name VARCHAR(100),
  born INTEGER
);
CREATE TABLE acted_in (
  role varchar(100),
  person_id INTEGER,
  movie_id INTEGER
);
CREATE TABLE directed (
  person_id INTEGER,
  movie_id INTEGER
);
CREATE TABLE produced (
  person_id INTEGER,
  movie_id INTEGER
);</pre>
<p>Populating with data:</p>
<pre class="programlisting" data-lang="sql">INSERT INTO movie (id, title, released, tagline)
VALUES (
  (1, 'The Matrix', 1999, 'Welcome to the Real World'),
  (2, 'The Devil''s Advocate', 1997, 'Evil has its winning ways'),
  (3, 'Monster', 2003, 'The first female serial killer of America')
);
INSERT INTO person (id, name, born)
VALUES (
  (1, 'Keanu Reeves', 1964),
  (2, 'Carrie-Anne Moss', 1967),
  (3, 'Laurence Fishburne', 1961),
  (4, 'Hugo Weaving', 1960),
  (5, 'Andy Wachowski', 1967),
  (6, 'Lana Wachowski', 1965),
  (7, 'Joel Silver', 1952),
  (8, 'Charlize Theron', 1975),
  (9, 'Al Pacino', 1940),
  (10, 'Taylor Hackford', 1944)
);
INSERT INTO acted_in (role, person_id, movie_id)
VALUES (
  ('Neo', 1, 1),
  ('Trinity', 2, 1),
  ('Morpheus', 3, 1),
  ('Agent Smith', 4, 1),
  ('Kevin Lomax', 1, 2),
  ('Mary Ann Lomax', 8, 2),
  ('John Milton', 9, 2),
  ('Aileen', 8, 3)
);
INSERT INTO directed (person_id, movie_id)
VALUES (
  (5, 1),
  (6, 1),
  (10, 2)
);
INSERT INTO produced (person_id, movie_id)
VALUES (
  (7, 1),
  (8, 3)
);</pre>
<p>Doing this in Neo4j will look quite different.
To begin with, we won’t create any schema up front.
We’ll come back to schema later, for now it’s enough to know that labels can be used right away without declaring them.</p>
<p>In the <code class="literal">CREATE</code> statements below, we tell Neo4j what data we want to have in the graph.
Simply put, the parentheses denote nodes, while the arrows (<code class="literal">--&gt;</code>, or in our case with a relationship type included <code class="literal">-[:DIRECTED]-&gt;</code>) denote relationships.
For the nodes we set identifiers like <code class="literal">TheMatrix</code> so we can easily refer to them later on in the statement.
Note that the identifiers are scoped to the statement, and not visible to other Cypher statements.
We could use identifiers for the relationships as well, but there’s no need for that in this case.</p>
<pre class="programlisting" data-lang="cypher">CREATE (TheMatrix:Movie { title:'The Matrix', released:1999, tagline:'Welcome to the Real World' })
CREATE (Keanu:Person { name:'Keanu Reeves', born:1964 })
CREATE (Carrie:Person { name:'Carrie-Anne Moss', born:1967 })
CREATE (Laurence:Person { name:'Laurence Fishburne', born:1961 })
CREATE (Hugo:Person { name:'Hugo Weaving', born:1960 })
CREATE (AndyW:Person { name:'Andy Wachowski', born:1967 })
CREATE (LanaW:Person { name:'Lana Wachowski', born:1965 })
CREATE (JoelS:Person { name:'Joel Silver', born:1952 })
CREATE (Keanu)-[:ACTED_IN { roles: ['Neo']}]-&gt;(TheMatrix),
  (Carrie)-[:ACTED_IN { roles: ['Trinity']}]-&gt;(TheMatrix),
  (Laurence)-[:ACTED_IN { roles: ['Morpheus']}]-&gt;(TheMatrix),
  (Hugo)-[:ACTED_IN { roles: ['Agent Smith']}]-&gt;(TheMatrix),(AndyW)-[:DIRECTED]-&gt;(TheMatrix),
  (LanaW)-[:DIRECTED]-&gt;(TheMatrix),(JoelS)-[:PRODUCED]-&gt;(TheMatrix)
CREATE (TheDevilsAdvocate:Movie { title:"The Devil's Advocate", released:1997,
  tagline: 'Evil has its winning ways' })
CREATE (Monster:Movie { title: 'Monster', released: 2003,
  tagline: 'The first female serial killer of America' })
CREATE (Charlize:Person { name:'Charlize Theron', born:1975 })
CREATE (Al:Person { name:'Al Pacino', born:1940 })
CREATE (Taylor:Person { name:'Taylor Hackford', born:1944 })
CREATE (Keanu)-[:ACTED_IN { roles: ['Kevin Lomax']}]-&gt;(TheDevilsAdvocate),
  (Charlize)-[:ACTED_IN { roles: ['Mary Ann Lomax']}]-&gt;(TheDevilsAdvocate),
  (Al)-[:ACTED_IN { roles: ['John Milton']}]-&gt;(TheDevilsAdvocate),
  (Taylor)-[:DIRECTED]-&gt;(TheDevilsAdvocate),(Charlize)-[:ACTED_IN { roles: ['Aileen']}]-&gt;(Monster),
  (Charlize)-[:PRODUCED { roles: ['Aileen']}]-&gt;(Monster)</pre>
</section>
<section class="section" id="_simple_read_of_data"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Simple read of data</h3></div></div></div>

<p>Let’s find all entries in the <code class="literal">movie</code> table and output their <code class="literal">title</code> attribute in our RDBMS:</p>
<pre class="programlisting" data-lang="sql">SELECT movie.title
FROM movie;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>TITLE</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">The Devil's Advocate</code></p></td></tr><tr><td><p><code class="literal">Monster</code></p></td></tr></tbody></table></div>
<p>Using Neo4j, find all nodes labeled <code class="literal">Movie</code> and output their <code class="literal">title</code> property:</p>
<pre class="programlisting" data-lang="cypher">MATCH (movie:Movie)
RETURN movie.title;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"The Devil's Advocate"</code></p></td></tr><tr><td><p><code class="literal">"Monster"</code></p></td></tr></tbody></table></div>
<p><code class="literal">MATCH</code> tells Neo4j to match a pattern in the graph.
In this case the pattern is very simple: any node with a <code class="literal">Movie</code> label on it.
We bind the result of the pattern matching to the identifier <code class="literal">movie</code>, for use in the <code class="literal">RETURN</code> clause.
And as you can see, the <code class="literal">RETURN</code> keyword of Cypher is similar to <code class="literal">SELECT</code> in SQL.</p>
<p>Now let’s get movies released after 1998.</p>
<pre class="programlisting" data-lang="sql">SELECT movie.title
FROM movie
WHERE movie.released &gt; 1998;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>TITLE</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">Monster</code></p></td></tr></tbody></table></div>
<p>In this case the addition actually looks identical in Cypher.</p>
<pre class="programlisting" data-lang="cypher">MATCH (movie:Movie)
WHERE movie.released &gt; 1998
RETURN movie.title;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"Monster"</code></p></td></tr></tbody></table></div>
<p>Note however that the semantics of <code class="literal">WHERE</code> in Cypher is somewhat different, see <a class="xref" href="query-where.html" title="11.3. Where">Section 11.3, “Where”</a> for more information.</p>
</section>
<section class="section" id="_join"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Join</h3></div></div></div>

<p>Let’s list all persons and the movies they acted in.</p>
<pre class="programlisting" data-lang="sql">SELECT person.name, movie.title
FROM person
  JOIN acted_in AS acted_in ON acted_in.person_id = person.id
  JOIN movie ON acted_in.movie_id = movie.id;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>NAME</th><th>TITLE</th></tr></thead><tfoot><tr><th colspan="2">8 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Keanu Reeves</code></p></td><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">Keanu Reeves</code></p></td><td><p><code class="literal">The Devil's Advocate</code></p></td></tr><tr><td><p><code class="literal">Carrie-Anne Moss</code></p></td><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">Laurence Fishburne</code></p></td><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">Hugo Weaving</code></p></td><td><p><code class="literal">The Matrix</code></p></td></tr><tr><td><p><code class="literal">Charlize Theron</code></p></td><td><p><code class="literal">The Devil's Advocate</code></p></td></tr><tr><td><p><code class="literal">Charlize Theron</code></p></td><td><p><code class="literal">Monster</code></p></td></tr><tr><td><p><code class="literal">Al Pacino</code></p></td><td><p><code class="literal">The Devil's Advocate</code></p></td></tr></tbody></table></div>
<p>The same using Cypher:</p>
<pre class="programlisting" data-lang="cypher">MATCH (person:Person)-[:ACTED_IN]-&gt;(movie:Movie)
RETURN person.name, movie.title;</pre>
<p>Here we match a <code class="literal">Person</code> and a <code class="literal">Movie</code> node, in case they are connected with an <code class="literal">ACTED_IN</code> relationship.</p>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>person.name</th><th>movie.title</th></tr></thead><tfoot><tr><th colspan="2">8 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Hugo Weaving"</code></p></td><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"Laurence Fishburne"</code></p></td><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"Carrie-Anne Moss"</code></p></td><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"Keanu Reeves"</code></p></td><td><p><code class="literal">"The Matrix"</code></p></td></tr><tr><td><p><code class="literal">"Al Pacino"</code></p></td><td><p><code class="literal">"The Devil's Advocate"</code></p></td></tr><tr><td><p><code class="literal">"Charlize Theron"</code></p></td><td><p><code class="literal">"The Devil's Advocate"</code></p></td></tr><tr><td><p><code class="literal">"Keanu Reeves"</code></p></td><td><p><code class="literal">"The Devil's Advocate"</code></p></td></tr><tr><td><p><code class="literal">"Charlize Theron"</code></p></td><td><p><code class="literal">"Monster"</code></p></td></tr></tbody></table></div>
<p>To make things slightly more complex, let’s search for the co-actors of Keanu Reeves.
In SQL we use a self join on the <code class="literal">person</code> table and join on the <code class="literal">acted_in</code> table once for Keanu, and once for the co-actors.</p>
<pre class="programlisting" data-lang="sql">SELECT DISTINCT co_actor.name
FROM person AS keanu
  JOIN acted_in AS acted_in1 ON acted_in1.person_id = keanu.id
  JOIN acted_in AS acted_in2 ON acted_in2.movie_id = acted_in1.movie_id
  JOIN person AS co_actor
    ON acted_in2.person_id = co_actor.id AND co_actor.id &lt;&gt; keanu.id
WHERE keanu.name = 'Keanu Reeves';</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>NAME</th></tr></thead><tfoot><tr><th>5 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Al Pacino</code></p></td></tr><tr><td><p><code class="literal">Carrie-Anne Moss</code></p></td></tr><tr><td><p><code class="literal">Charlize Theron</code></p></td></tr><tr><td><p><code class="literal">Hugo Weaving</code></p></td></tr><tr><td><p><code class="literal">Laurence Fishburne</code></p></td></tr></tbody></table></div>
<p>In Cypher, we use a pattern with two paths that target the same <code class="literal">Movie</code> node.</p>
<pre class="programlisting" data-lang="cypher">MATCH (keanu:Person)-[:ACTED_IN]-&gt;(movie:Movie),(coActor:Person)-[:ACTED_IN]-&gt;(movie)
WHERE keanu.name = 'Keanu Reeves'
RETURN DISTINCT coActor.name;</pre>
<p>You may have noticed that we used the <code class="literal">co_actor.id &lt;&gt; keanu.id</code> predicate in SQL only.
This is because Neo4j will only match on the <code class="literal">ACTED_IN</code> relationship once in the same pattern.
If this is not what we want, we can split the pattern up by using two <code class="literal">MATCH</code> clauses like this:</p>
<pre class="programlisting" data-lang="cypher">MATCH (keanu:Person)-[:ACTED_IN]-&gt;(movie:Movie)
MATCH (coActor:Person)-[:ACTED_IN]-&gt;(movie)
WHERE keanu.name = 'Keanu Reeves'
RETURN DISTINCT coActor.name;</pre>
<p>This time Keanu Reeves is included in the result as well:</p>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>coActor.name</th></tr></thead><tfoot><tr><th>6 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Hugo Weaving"</code></p></td></tr><tr><td><p><code class="literal">"Laurence Fishburne"</code></p></td></tr><tr><td><p><code class="literal">"Carrie-Anne Moss"</code></p></td></tr><tr><td><p><code class="literal">"Keanu Reeves"</code></p></td></tr><tr><td><p><code class="literal">"Al Pacino"</code></p></td></tr><tr><td><p><code class="literal">"Charlize Theron"</code></p></td></tr></tbody></table></div>
<p>Next, let’s find out who has both acted in and produced movies.</p>
<pre class="programlisting" data-lang="sql">SELECT person.name
FROM person
WHERE person.id IN (SELECT person_id FROM acted_in)
  AND person.id IN (SELECT person_id FROM produced)</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>NAME</th></tr></thead><tfoot><tr><th>1 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Charlize Theron</code></p></td></tr></tbody></table></div>
<p>In Cypher, we use patterns as predicates in this case.
That is, we require the relationships to exist, but don’t care about the connected nodes; thus the empty parentheses.</p>
<pre class="programlisting" data-lang="cypher">MATCH (person:Person)
WHERE (person)-[:ACTED_IN]-&gt;() AND (person)-[:PRODUCED]-&gt;()
RETURN person.name</pre>
</section>
<section class="section" id="_aggregation"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Aggregation</h3></div></div></div>

<p>Now let’s find out a bit about the directors in movies that Keanu Reeves acted in.
We want to know how many of those movies each of them directed.</p>
<pre class="programlisting" data-lang="sql">SELECT director.name, count(*)
FROM person keanu
  JOIN acted_in ON keanu.id = acted_in.person_id
  JOIN directed ON acted_in.movie_id = directed.movie_id
  JOIN person AS director ON directed.person_id = director.id
WHERE keanu.name = 'Keanu Reeves'
GROUP BY director.name
ORDER BY count(*) DESC</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>NAME</th><th>C2</th></tr></thead><tfoot><tr><th colspan="2">3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Andy Wachowski</code></p></td><td><p><code class="literal">1</code></p></td></tr><tr><td><p><code class="literal">Lana Wachowski</code></p></td><td><p><code class="literal">1</code></p></td></tr><tr><td><p><code class="literal">Taylor Hackford</code></p></td><td><p><code class="literal">1</code></p></td></tr></tbody></table></div>
<p>Here’s how we’ll do the same in Cypher:</p>
<pre class="programlisting" data-lang="cypher">MATCH (keanu:Person { name: 'Keanu Reeves' })-[:ACTED_IN]-&gt;(movie:Movie),
  (director:Person)-[:DIRECTED]-&gt;(movie)
RETURN director.name, count(*)
ORDER BY count(*) DESC</pre>
<p>As you can see there is no <code class="literal">GROUP BY</code> in the Cypher equivalent.
Instead, Neo4j will automatically figure out the grouping key.</p>
<p class="cypherdoc-console"></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>