<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>4.3. Patterns in Practice -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypher-intro-patterns.html" title="4.2. Graphs, Patterns, and Cypher" /><link rel="next" href="cypherdoc-getting-the-results-you-want.html" title="4.4. Getting the Results You Want" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="4.3. Patterns in Practice" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-75824";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>4.3. Patterns in Practice</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypher-intro-patterns.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="cypher-getting-started.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypherdoc-getting-the-results-you-want.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-patterns-in-practice"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">4.3. Patterns in Practice</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="cypherdoc-patterns-in-practice.html#_creating_data">Creating Data</a></span></li><li><span class="section"><a href="cypherdoc-patterns-in-practice.html#_matching_patterns">Matching Patterns</a></span></li><li><span class="section"><a href="cypherdoc-patterns-in-practice.html#_attaching_structures">Attaching Structures</a></span></li><li><span class="section"><a href="cypherdoc-patterns-in-practice.html#_completing_patterns">Completing Patterns</a></span></li></ul></div>

<section class="section" id="_creating_data"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Creating Data</h3></div></div></div>

<p>We’ll start by looking into the clauses that allow us to create data.</p>
<p>To add data, we just use the patterns we already know.
By providing patterns we can specify what graph structures, labels and properties we would like to make part of our graph.</p>
<p>Obviously the simplest clause is called <code class="literal">CREATE</code>.
It will just go ahead and directly create the patterns that you specify.</p>
<p>For the patterns we’ve looked at so far this could look like the following:</p>
<pre class="programlisting" data-lang="cypher">CREATE (:Movie { title:"The Matrix",released:1997 })</pre>
<p>If we execute this statement, Cypher returns the number of changes, in this case adding 1 node, 1 label and 2 properties.</p>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><tfoot><tr><th>Nodes created: 1
</th></tr><tr><th>Properties set: 2
</th></tr><tr><th>Labels added: 1</th></tr></tfoot><tbody><tr><td class="emptyresult"><p><code class="literal">(empty result)</code></p></td></tr></tbody></table></div>
<p>As we started out with an empty database, we now have a database with a single node in it:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc--c5640ed8.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc--c5640ed8.svg" alt="cypherdoc--c5640ed8.svg" /></span>
</a>
</div>
<p>If case we also want to return the created data we can add a <code class="literal">RETURN</code> clause, which refers to the identifier we’ve assigned to our pattern elements.</p>
<pre class="programlisting" data-lang="cypher">CREATE (p:Person { name:"Keanu Reeves", born:1964 })
RETURN p</pre>
<p>This is what gets returned:</p>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Properties set: 2
</th></tr><tr><th>Labels added: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Keanu Reeves",born:1964}</code></p></td></tr></tbody></table></div>
<p>If we want to create more than one element, we can separate the elements with commas or use multiple <code class="literal">CREATE</code> statements.</p>
<p>We can of course also create more complex structures, like an <code class="literal">ACTED_IN</code> relationship with information about the character, or <code class="literal">DIRECTED</code> ones for the director.</p>
<pre class="programlisting" data-lang="cypher">CREATE (a:Person { name:"Tom Hanks",
  born:1956 })-[r:ACTED_IN { roles: ["Forrest"]}]-&gt;(m:Movie { title:"Forrest Gump",released:1994 })
CREATE (d:Person { name:"Robert Zemeckis", born:1951 })-[:DIRECTED]-&gt;(m)
RETURN a,d,r,m</pre>
<p>This is the part of the graph we just updated:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-b3411d1d.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-b3411d1d.svg" alt="cypherdoc-result-b3411d1d.svg" /></span>
</a>
</div>
<p>In most cases, we want to connect new data to existing structures.
This requires that we know how to find existing patterns in our graph data, which we will look at next.</p>
</section>
<section class="section" id="_matching_patterns"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Matching Patterns</h3></div></div></div>

<p>Matching patterns is a task for the <code class="literal">MATCH</code> statement.
We pass the same kind of patterns we’ve used so far to <code class="literal">MATCH</code> to describe what we’re looking for.
It is similar to <span class="emphasis"><em>query by example</em></span>, only that our examples also include the structures.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>A <code class="literal">MATCH</code> statement will search for the patterns we specify and return <span class="emphasis"><em>one row per successful pattern match</em></span>.</p></td></tr></table></div>
<p>To find the data we’ve created so far, we can start looking for all nodes labeled with the <code class="literal">Movie</code> label.</p>
<pre class="programlisting" data-lang="cypher">MATCH (m:Movie)
RETURN m</pre>
<p>Here’s the result:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-0.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-0.svg" alt="cypherdoc-result-0.svg" /></span>
</a>
</div>
<p>This should show both <span class="emphasis"><em>The Matrix</em></span> and <span class="emphasis"><em>Forrest Gump</em></span>.</p>
<p>We can also look for a specific person, like <span class="emphasis"><em>Keanu Reeves</em></span>.</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person { name:"Keanu Reeves" })
RETURN p</pre>
<p>This query returns the matching node:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-0.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-0.svg" alt="cypherdoc-result-0.svg" /></span>
</a>
</div>
<p>Note that we only provide enough information to find the nodes, not all properties are required.
In most cases you have key-properties like SSN, ISBN, emails, logins, geolocation or product codes to look for.</p>
<p>We can also find more interesting connections, like for instance the movies titles that <span class="emphasis"><em>Tom Hanks</em></span> acted in and the roles he played.</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person { name:"Tom Hanks" })-[r:ACTED_IN]-&gt;(m:Movie)
RETURN m.title, r.roles</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>m.title</th><th>r.roles</th></tr></thead><tfoot><tr><th colspan="2">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Forrest Gump"</code></p></td><td><p><code class="literal">["Forrest"]</code></p></td></tr></tbody></table></div>
<p>In this case we only returned the properties of the nodes and relationships that we were interested in.
You can access them everywhere via a dot notation <code class="literal">identifer.property</code>.</p>
<p>Of course this only lists his role as <span class="emphasis"><em>Forrest</em></span> in <span class="emphasis"><em>Forrest Gump</em></span> because that’s all data that we’ve added.</p>
<p>Now we know enough to connect new nodes to existing ones and can combine <code class="literal">MATCH</code> and <code class="literal">CREATE</code> to attach structures to the graph.</p>
</section>
<section class="section" id="_attaching_structures"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Attaching Structures</h3></div></div></div>

<p>To extend the graph with new information, we first match the existing connection points and then attach the newly created nodes to them with relationships.
Adding <span class="emphasis"><em>Cloud Atlas</em></span> as a new movie for <span class="emphasis"><em>Tom Hanks</em></span> could be achieved like this:</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person { name:"Tom Hanks" })
CREATE (m:Movie { title:"Cloud Atlas",released:2012 })
CREATE (p)-[r:ACTED_IN { roles: ['Zachry']}]-&gt;(m)
RETURN p,r,m</pre>
<p>Here’s what the structure looks like in the database:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-36eb9048.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-36eb9048.svg" alt="cypherdoc-result-36eb9048.svg" /></span>
</a>
</div>
<div class="admonitionblock Tip"><table><tr><td class="icon"><img alt="[Tip]" src="images/icons/admon/tip.svg" /></td><td class="content"><b>Tip</b><p>It is important to remember that we can assign identifiers to both nodes and relationships and use them later on, no matter if they were created or matched.</p></td></tr></table></div>
<p>It is possible to attach both node and relationship in a single <code class="literal">CREATE</code> clause.
For readability it helps to split them up though.</p>
<div class="admonitionblock Important"><table><tr><td class="icon"><img alt="[Important]" src="images/icons/admon/important.svg" /></td><td class="content"><b>Important</b><p>A tricky aspect of the combination of <code class="literal">MATCH</code> and <code class="literal">CREATE</code> is that we get <span class="emphasis"><em>one row per matched pattern</em></span>.
This causes subsequent <code class="literal">CREATE</code> statements to be executed once for each row.
In many cases this is what you want.
If that’s not intended, please move the <code class="literal">CREATE</code> statement before the <code class="literal">MATCH</code>, or change the cardinality of the query with means discussed later or use the <span class="emphasis"><em>get or create</em></span> semantics of the next clause: <code class="literal">MERGE</code>.</p></td></tr></table></div>
</section>
<section class="section" id="_completing_patterns"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Completing Patterns</h3></div></div></div>

<p>Whenever we get data from external systems or are not sure if certain information already exists in the graph, we want to be able to express a repeatable (idempotent) update operation.
In Cypher <code class="literal">MERGE</code> has this function.
It acts like a combination of <code class="literal">MATCH</code> <span class="emphasis"><em>or</em></span> <code class="literal">CREATE</code>, which checks for the existence of data first before creating it.
With <code class="literal">MERGE</code> you define a pattern to be found or created.
Usually, as with <code class="literal">MATCH</code> you only want to include the key property to look for in your core pattern.
<code class="literal">MERGE</code> allows you to provide additional properties you want to set <code class="literal">ON CREATE</code>.</p>
<p>If we wouldn’t know if our graph already contained <span class="emphasis"><em>Cloud Atlas</em></span> we could merge it in again.</p>
<pre class="programlisting" data-lang="cypher">MERGE (m:Movie { title:"Cloud Atlas" })
ON CREATE SET m.released = 2012
RETURN m</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>m</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[5]{title:"Cloud Atlas",released:2012}</code></p></td></tr></tbody></table></div>
<p>We get a result in any both cases: either the data (potentially more than one row) that was already in the graph or a single, newly created <code class="literal">Movie</code> node.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>A <code class="literal">MERGE</code> clause without any previously assigned identifiers in it either matches the full pattern or creates the full pattern.
It never produces a partial mix of matching and creating within a pattern.
To achieve a partial match/create, make sure to use already defined identifiers for the parts that shouldn’t be affected.</p></td></tr></table></div>
<p>So foremost <code class="literal">MERGE</code> makes sure that you can’t create duplicate information or structures, but it comes with the cost of needing to check for existing matches first.
Especially on large graphs it can be costly to scan a large set of labeled nodes for a certain property.
You can alleviate some of that by creating supporting indexes or constraints, which we’ll discuss later.
But it’s still not for free, so whenever you’re sure to not create duplicate data use <code class="literal">CREATE</code> over <code class="literal">MERGE</code>.</p>
<div class="admonitionblock Tip"><table><tr><td class="icon"><img alt="[Tip]" src="images/icons/admon/tip.svg" /></td><td class="content"><b>Tip</b><p><code class="literal">MERGE</code> can also assert that a relationship is only created once.
For that to work you <span class="emphasis"><em>have to pass in</em></span> both nodes from a previous pattern match.</p></td></tr></table></div>
<pre class="programlisting" data-lang="cypher">MATCH (m:Movie { title:"Cloud Atlas" })
MATCH (p:Person { name:"Tom Hanks" })
MERGE (p)-[r:ACTED_IN]-&gt;(m)
ON CREATE SET r.roles =['Zachry']
RETURN p,r,m</pre>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-36eb9048.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-36eb9048.svg" alt="cypherdoc-result-36eb9048.svg" /></span>
</a>
</div>
<p>In case the direction of a relationship is arbitrary, you can leave off the arrowhead.
<code class="literal">MERGE</code> will then check for the relationship in either direction, and create a new directed relationship if no matching relationship was found.</p>
<p>If you choose to pass in only one node from a preceding clause, <code class="literal">MERGE</code> offers an interesting functionality.
It will then only match within the direct neighborhood of the provided node for the given pattern, and, if not found create it.
This can come in very handy for creating for example tree structures.</p>
<pre class="programlisting" data-lang="cypher">CREATE (y:Year { year:2014 })
MERGE (y)&lt;-[:IN_YEAR]-(m10:Month { month:10 })
MERGE (y)&lt;-[:IN_YEAR]-(m11:Month { month:11 })
RETURN y,m10,m11</pre>
<p>This is the graph structure that gets created:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc-result-199ba358.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc-result-199ba358.svg" alt="cypherdoc-result-199ba358.svg" /></span>
</a>
</div>
<p>Here there is no global search for the two <code class="literal">Month</code> nodes; they are only searched for in the context of the <span class="emphasis"><em>2014</em></span> <code class="literal">Year</code> node.</p>
<p class="cypherdoc-console"></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>