<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>16.2. Query tuning example -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="_general_information.html" title="16.1. General information" /><link rel="next" href="reference-documentation.html" title="Reference" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="16.2. Query tuning example" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-75988";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.10.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>16.2. Query tuning example</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="_general_information.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-tuning.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="reference-documentation.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-query-tuning-example"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">16.2. Query tuning example</h2></div></div></div>

<p>We start with the following data set:</p>
<p class="setup-query"></p>
<pre class="programlisting" data-lang="cypher">CREATE (adam:Person { name: 'Adam' })
CREATE (pernilla:Person { name: 'Pernilla' })
CREATE (david:Person { name: 'David' })
CREATE (adam)-[:FRIEND]-&gt;(pernilla)
CREATE (pernilla)-[:FRIEND]-&gt;(david)</pre>
<p>And we want to do query to find Pernilla.
We might start with the following query:</p>
<pre class="programlisting" data-lang="cypher">MATCH (p { name:"Pernilla" })
RETURN p</pre>
<p>As the number of nodes in the database increase this query will slow down so we’d have a look at the profile output to try and work out why that is:</p>
<pre class="programlisting" data-lang="plain">Compiler CYPHER 2.2

Planner COST

Filter
  |
  +AllNodesScan

+--------------+---------------+------+--------+-------------+----------------------------------------+
|     Operator | EstimatedRows | Rows | DbHits | Identifiers |                                  Other |
+--------------+---------------+------+--------+-------------+----------------------------------------+
|       Filter |             0 |    1 |      6 |           p | Property(p,name(0)) == {  AUTOSTRING0} |
| AllNodesScan |             3 |    3 |      4 |           p |                                        |
+--------------+---------------+------+--------+-------------+----------------------------------------+

Total database accesses: 10</pre>
<p>The inclusion of <a class="link" href="query-plan-all-nodes-scan.html" title="15.2. All Nodes Scan">All Nodes Scan</a> indicates that the query planner scanned all the nodes in the database, checking the <code class="literal">name</code> property on each one.</p>
<p>When searching for the start nodes for our query we should specify a label to narrow down the search area.
For this query we can include a <code class="literal">Person</code> like so:</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person { name:"Pernilla" })
RETURN p</pre>
<p>This query will be faster than the first one but as the number of people increase we notice that our query slows down.</p>
<p>Again we can look at the profile output to work out why:</p>
<pre class="programlisting" data-lang="plain">Compiler CYPHER 2.2

Planner COST

Filter
  |
  +NodeByLabelScan

+-----------------+---------------+------+--------+-------------+----------------------------------------+
|        Operator | EstimatedRows | Rows | DbHits | Identifiers |                                  Other |
+-----------------+---------------+------+--------+-------------+----------------------------------------+
|          Filter |             0 |    1 |      6 |           p | Property(p,name(0)) == {  AUTOSTRING0} |
| NodeByLabelScan |             3 |    3 |      4 |           p |                                :Person |
+-----------------+---------------+------+--------+-------------+----------------------------------------+

Total database accesses: 10</pre>
<p>The <a class="link" href="query-plan-node-by-label-scan.html" title="15.7. Node by label scan">Label Scan</a> operator indicates that when we look up <code class="literal">Pernilla</code> a linear scan of all the <code class="literal">Person</code> nodes in the database is being executed.</p>
<p>If we’re going to be looking up people by name frequently then we’ll want to create an index on the <code class="literal">name</code> property for the <code class="literal">Person</code> label:</p>
<pre class="programlisting" data-lang="cypher">CREATE INDEX ON :Person(name)</pre>
<p>Now if we run the query again it will run more quickly:</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person { name:"Pernilla" })
RETURN p</pre>
<p>Let’s look at the profile output again:</p>
<pre class="programlisting" data-lang="plain">Compiler CYPHER 2.2

Planner COST

NodeIndexSeek

+---------------+---------------+------+--------+-------------+---------------+
|      Operator | EstimatedRows | Rows | DbHits | Identifiers |         Other |
+---------------+---------------+------+--------+-------------+---------------+
| NodeIndexSeek |             1 |    1 |      2 |           p | :Person(name) |
+---------------+---------------+------+--------+-------------+---------------+

Total database accesses: 2</pre>
<p>Now the query planner makes use of the <a class="link" href="query-plan-node-index-seek.html" title="15.9. Node index seek">Node Index Seek</a> operator which does an index lookup and therefore gives us a performance improvement.</p>
<p class="cypherdoc-console"></p>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>