<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>9.5. With -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-skip.html" title="9.4. Skip" /><link rel="next" href="query-unwind.html" title="9.6. Unwind" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="9.5. With" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-72629";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>9.5. With</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-skip.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-general.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-unwind.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-with"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">9.5. With</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-with.html#with-filter-on-aggregate-function-results">Filter on aggregate function results</a></span></li><li><span class="section"><a href="query-with.html#with-sort-results-before-using-collect-on-them">Sort results before using collect on them</a></span></li><li><span class="section"><a href="query-with.html#with-limit-branching-of-your-path-search">Limit branching of your path search</a></span></li></ul></div>

<p>With <code class="literal">WITH</code>, you can manipulate the result sequence before it is passed on to the following query parts. The
manipulations can be of the shape and/or number of entries in the result set.</p>
<p>One common usage of <code class="literal">WITH</code> is to limit the number of entries that are then passed on to other <code class="literal">MATCH</code> clauses.
By combining <code class="literal">ORDER</code> <code class="literal">BY</code> and <code class="literal">LIMIT</code>, it’s possible to get the top X entries by some criteria, and then bring
in additional data from the graph.</p>
<p>Another use is to filter on aggregated values. <code class="literal">WITH</code> is used to introduce aggregates which can then by used in
predicates in <code class="literal">WHERE</code>. These aggregate expressions create new bindings in the results. <code class="literal">WITH</code> can also, just like
<code class="literal">RETURN</code>, alias expressions that are introduced into the results using the aliases as binding name.</p>
<p><code class="literal">WITH</code> is also used to separate reading from updating of the graph. Every part of a query must be either
read-only or write-only. When going from a writing part to a reading part, the switch must be done
with a <code class="literal">WITH</code> clause.</p>
<div class="figure" id="d5e6064"><p class="title"><strong>Figure 9.5. Graph</strong></p><div class="figure-contents">
<a class="ulink" href="images/cypher-with-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-with-graph.svg" alt="cypher-with-graph.svg" /></span>
</a>
</div></div>
<section class="section" id="with-filter-on-aggregate-function-results"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Filter on aggregate function results</h3></div></div></div>

<p>Aggregated results have to pass through a <code class="literal">WITH</code> clause to be able to filter on.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (david { name: "David" })--(otherPerson)--&gt;()
WITH otherPerson, count(*) AS foaf
WHERE foaf &gt; 1
RETURN otherPerson</pre><p>
</p>
<p>The person connected to David with the at least more than one outgoing relationship will be returned by the query.</p>
<div class="queryresult table" id="d5e6081"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>otherPerson</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[2]{name:"Anders"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`name`:"David"})
create (_1 {`name`:"Emil"})
create (_2 {`name`:"Anders"})
create (_3 {`name`:"Bossman"})
create (_4 {`name`:"Ceasar"})
create _0-[:`KNOWS`]-&gt;_2
create _2-[:`KNOWS`]-&gt;_3
create _2-[:`BLOCKS`]-&gt;_4
create _3-[:`KNOWS`]-&gt;_1
create _3-[:`BLOCKS`]-&gt;_0
create _4-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (david {name: "David"})--(otherPerson)--&gt;() with otherPerson, count(*) as foaf where foaf &gt; 1 return otherPerson</strong></span></p>
</section>
<section class="section" id="with-sort-results-before-using-collect-on-them"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Sort results before using collect on them</h3></div></div></div>

<p>You can sort your results before passing them to collect, thus sorting the resulting collection.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
WITH n
ORDER BY n.name DESC LIMIT 3
RETURN collect(n.name)</pre><p>
</p>
<p>A list of the names of people in reverse order, limited to 3, in a collection.</p>
<div class="queryresult table" id="d5e6109"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>collect(n.name)</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">["Emil","David","Ceasar"]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`name`:"David"})
create (_1 {`name`:"Emil"})
create (_2 {`name`:"Anders"})
create (_3 {`name`:"Bossman"})
create (_4 {`name`:"Ceasar"})
create _0-[:`KNOWS`]-&gt;_2
create _2-[:`KNOWS`]-&gt;_3
create _2-[:`BLOCKS`]-&gt;_4
create _3-[:`KNOWS`]-&gt;_1
create _3-[:`BLOCKS`]-&gt;_0
create _4-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (n) with n order by n.name desc limit 3 return collect(n.name)</strong></span></p>
</section>
<section class="section" id="with-limit-branching-of-your-path-search"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Limit branching of your path search</h3></div></div></div>

<p>You can match paths, limit to a certain number, and then match again using those paths as a base As well as any number of similar limited searches.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: "Anders" })--(m)
WITH m
ORDER BY m.name DESC LIMIT 1
MATCH (m)--(o)
RETURN o.name</pre><p>
</p>
<p>Starting at Anders, find all matching nodes, order by name descending and get the top result, then find all the nodes connected to that top result, and return their names.</p>
<div class="queryresult table" id="d5e6137"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>o.name</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Anders"</code></p></td></tr><tr><td><p><code class="literal">"Bossman"</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`name`:"David"})
create (_1 {`name`:"Emil"})
create (_2 {`name`:"Anders"})
create (_3 {`name`:"Bossman"})
create (_4 {`name`:"Ceasar"})
create _0-[:`KNOWS`]-&gt;_2
create _2-[:`KNOWS`]-&gt;_3
create _2-[:`BLOCKS`]-&gt;_4
create _3-[:`KNOWS`]-&gt;_1
create _3-[:`BLOCKS`]-&gt;_0
create _4-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (n {name: "Anders"})--(m) with m order by m.name desc limit 1 match (m)--(o) return o.name</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>