<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>12.1. Predicates -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-function.html" title="Chapter 12. Functions" /><link rel="next" href="query-functions-scalar.html" title="12.2. Scalar functions" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="12.1. Predicates" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-72590";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>12.1. Predicates</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-function.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-function.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-functions-scalar.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-predicates"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">12.1. Predicates</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-predicates.html#functions-all">ALL</a></span></li><li><span class="section"><a href="query-predicates.html#functions-any">ANY</a></span></li><li><span class="section"><a href="query-predicates.html#functions-none">NONE</a></span></li><li><span class="section"><a href="query-predicates.html#functions-single">SINGLE</a></span></li><li><span class="section"><a href="query-predicates.html#functions-exists">EXISTS</a></span></li></ul></div>

<p>Predicates are boolean functions that return true or false for a given set of input.
They are most commonly used to filter out subgraphs in the <code class="literal">WHERE</code> part of a query.</p>
<p>See also <a class="xref" href="query-operators.html#query-operators-comparison" title="Comparison operators">the section called “Comparison operators”</a>.</p>
<div class="figure" id="d5e10592"><p class="title"><strong>Figure 12.1. Graph</strong></p><div class="figure-contents">
<a class="ulink" href="images/cypher-functions-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-functions-graph.svg" alt="cypher-functions-graph.svg" /></span>
</a>
</div></div>
<section class="section" id="functions-all"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">ALL</h3></div></div></div>

<p>Tests whether a predicate holds for all element of this collection collection.</p>
<p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ALL(identifier in collection WHERE predicate)</code></p>
<p><span class="strong"><strong>Arguments:</strong></span></p>
<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">

<span class="emphasis"><em>collection:</em></span> An expression that returns a collection

</li><li class="listitem">

<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.

</li><li class="listitem">

<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.

</li></ul></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p=(a)-[*1..3]-&gt;(b)
WHERE a.name='Alice' AND b.name='Daniel' AND ALL (x IN nodes(p) WHERE x.age &gt; 30)
RETURN p</pre><p>
</p>
<p>All nodes in the returned paths will have an <code class="literal">age</code> property of at least 30.</p>
<div class="queryresult table" id="d5e10624"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"},:KNOWS[3]{},Node[0]{name:"Daniel",age:54,eyes:"brown"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`age`:54, `eyes`:"brown", `name`:"Daniel"})
create (_1:`Spouse` {`age`:41, `array`:["one", "two", "three"], `eyes`:"blue", `name`:"Eskil"})
create (_2:`foo`:`bar` {`age`:38, `eyes`:"brown", `name`:"Alice"})
create (_3 {`age`:25, `eyes`:"blue", `name`:"Bob"})
create (_4 {`age`:53, `eyes`:"green", `name`:"Charlie"})
create _2-[:`KNOWS`]-&gt;_4
create _2-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_0
create _3-[:`MARRIED`]-&gt;_1
create _4-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match p=(a)-[*1..3]-&gt;(b) where a.name='Alice' and b.name='Daniel' and all(x in nodes(p) WHERE x.age &gt; 30) return p</strong></span></p>
</section>
<section class="section" id="functions-any"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">ANY</h3></div></div></div>

<p>Tests whether a predicate holds for at least one element in the collection.</p>
<p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ANY(identifier in collection WHERE predicate)</code></p>
<p><span class="strong"><strong>Arguments:</strong></span></p>
<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">

<span class="emphasis"><em>collection:</em></span> An expression that returns a collection

</li><li class="listitem">

<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.

</li><li class="listitem">

<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.

</li></ul></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a)
WHERE a.name='Eskil' AND ANY (x IN a.array WHERE x = "one")
RETURN a</pre><p>
</p>
<p>All nodes in the returned paths has at least one <code class="literal">one</code> value set in the array property named <code class="literal">array</code>.</p>
<div class="queryresult table" id="d5e10669"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>a</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Eskil",age:41,eyes:"blue",array:["one","two","three"]}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`age`:54, `eyes`:"brown", `name`:"Daniel"})
create (_1:`Spouse` {`age`:41, `array`:["one", "two", "three"], `eyes`:"blue", `name`:"Eskil"})
create (_2:`foo`:`bar` {`age`:38, `eyes`:"brown", `name`:"Alice"})
create (_3 {`age`:25, `eyes`:"blue", `name`:"Bob"})
create (_4 {`age`:53, `eyes`:"green", `name`:"Charlie"})
create _2-[:`KNOWS`]-&gt;_4
create _2-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_0
create _3-[:`MARRIED`]-&gt;_1
create _4-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match (a) where a.name='Eskil' and any(x in a.array WHERE x = "one") return a</strong></span></p>
</section>
<section class="section" id="functions-none"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">NONE</h3></div></div></div>

<p>Returns true if the predicate holds for no element in the collection.</p>
<p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">NONE(identifier in collection WHERE predicate)</code></p>
<p><span class="strong"><strong>Arguments:</strong></span></p>
<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">

<span class="emphasis"><em>collection:</em></span> An expression that returns a collection

</li><li class="listitem">

<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.

</li><li class="listitem">

<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.

</li></ul></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p=(n)-[*1..3]-&gt;(b)
WHERE n.name='Alice' AND NONE (x IN nodes(p) WHERE x.age = 25)
RETURN p</pre><p>
</p>
<p>No nodes in the returned paths has a <code class="literal">age</code> property set to <code class="literal">25</code>.</p>
<div class="queryresult table" id="d5e10714"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"}]</code></p></td></tr><tr><td><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"},:KNOWS[3]{},Node[0]{name:"Daniel",age:54,eyes:"brown"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`age`:54, `eyes`:"brown", `name`:"Daniel"})
create (_1:`Spouse` {`age`:41, `array`:["one", "two", "three"], `eyes`:"blue", `name`:"Eskil"})
create (_2:`foo`:`bar` {`age`:38, `eyes`:"brown", `name`:"Alice"})
create (_3 {`age`:25, `eyes`:"blue", `name`:"Bob"})
create (_4 {`age`:53, `eyes`:"green", `name`:"Charlie"})
create _2-[:`KNOWS`]-&gt;_4
create _2-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_0
create _3-[:`MARRIED`]-&gt;_1
create _4-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match p=(n)-[*1..3]-&gt;(b) where n.name='Alice' and NONE(x in nodes(p) WHERE x.age = 25) return p</strong></span></p>
</section>
<section class="section" id="functions-single"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">SINGLE</h3></div></div></div>

<p>Returns true if the predicate holds for exactly one of the elements in the collection.</p>
<p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">SINGLE(identifier in collection WHERE predicate)</code></p>
<p><span class="strong"><strong>Arguments:</strong></span></p>
<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">

<span class="emphasis"><em>collection:</em></span> An expression that returns a collection

</li><li class="listitem">

<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.

</li><li class="listitem">

<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.

</li></ul></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p=(n)--&gt;(b)
WHERE n.name='Alice' AND SINGLE (var IN nodes(p) WHERE var.eyes = "blue")
RETURN p</pre><p>
</p>
<p>Exactly one node in every returned path will have the <code class="literal">eyes</code> property set to <code class="literal">"blue"</code>.</p>
<div class="queryresult table" id="d5e10763"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[0]{},Node[3]{name:"Bob",age:25,eyes:"blue"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`age`:54, `eyes`:"brown", `name`:"Daniel"})
create (_1:`Spouse` {`age`:41, `array`:["one", "two", "three"], `eyes`:"blue", `name`:"Eskil"})
create (_2:`foo`:`bar` {`age`:38, `eyes`:"brown", `name`:"Alice"})
create (_3 {`age`:25, `eyes`:"blue", `name`:"Bob"})
create (_4 {`age`:53, `eyes`:"green", `name`:"Charlie"})
create _2-[:`KNOWS`]-&gt;_4
create _2-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_0
create _3-[:`MARRIED`]-&gt;_1
create _4-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match p=(n)--&gt;(b) where n.name='Alice' and SINGLE(var in nodes(p) WHERE var.eyes = "blue") return p</strong></span></p>
</section>
<section class="section" id="functions-exists"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">EXISTS</h3></div></div></div>

<p>Returns true if a match for the pattern exists in the graph, or the property exists in the node, relationship or map.</p>
<p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">EXISTS( pattern-or-property )</code></p>
<p><span class="strong"><strong>Arguments:</strong></span></p>
<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">

<span class="emphasis"><em>pattern-or-property:</em></span> A pattern or a property (in the form <span class="emphasis"><em>identifier.prop</em></span>).

</li></ul></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
WHERE EXISTS(n.name)
RETURN n.name AS name, EXISTS((n)-[:MARRIED]-&gt;()) AS is_married</pre><p>
</p>
<p>This query returns all the nodes with a name property along with a boolean true/false indicating if they are married.</p>
<div class="queryresult table" id="d5e10801"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>name</th><th>is_married</th></tr></thead><tfoot><tr><th colspan="2">5 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Daniel"</code></p></td><td><p><code class="literal">false</code></p></td></tr><tr><td><p><code class="literal">"Eskil"</code></p></td><td><p><code class="literal">false</code></p></td></tr><tr><td><p><code class="literal">"Alice"</code></p></td><td><p><code class="literal">false</code></p></td></tr><tr><td><p><code class="literal">"Bob"</code></p></td><td><p><code class="literal">true</code></p></td></tr><tr><td><p><code class="literal">"Charlie"</code></p></td><td><p><code class="literal">false</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0 {`age`:54, `eyes`:"brown", `name`:"Daniel"})
create (_1:`Spouse` {`age`:41, `array`:["one", "two", "three"], `eyes`:"blue", `name`:"Eskil"})
create (_2:`foo`:`bar` {`age`:38, `eyes`:"brown", `name`:"Alice"})
create (_3 {`age`:25, `eyes`:"blue", `name`:"Bob"})
create (_4 {`age`:53, `eyes`:"green", `name`:"Charlie"})
create _2-[:`KNOWS`]-&gt;_4
create _2-[:`KNOWS`]-&gt;_3
create _3-[:`KNOWS`]-&gt;_0
create _3-[:`MARRIED`]-&gt;_1
create _4-[:`KNOWS`]-&gt;_0
</span><span class="command"><strong>
 match (n) where EXISTS(n.name) return n.name AS name, EXISTS( (n)-[:MARRIED]-&gt;() ) AS is_married</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>