<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>10.1. Match -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="next" href="query-optional-match.html" title="10.2. Optional Match" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="10.1. Match" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-72623";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>10.1. Match</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-read.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-read.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-optional-match.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-match"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">10.1. Match</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-match.html#_introduction_2">Introduction</a></span></li><li><span class="section"><a href="query-match.html#_basic_node_finding">Basic node finding</a></span></li><li><span class="section"><a href="query-match.html#_relationship_basics">Relationship basics</a></span></li><li><span class="section"><a href="query-match.html#_relationships_in_depth">Relationships in depth</a></span></li><li><span class="section"><a href="query-match.html#_shortest_path">Shortest path</a></span></li><li><span class="section"><a href="query-match.html#_get_node_or_relationship_by_id">Get node or relationship by id</a></span></li></ul></div>

<section class="section" id="_introduction_2"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Introduction</h3></div></div></div>

<p>The <code class="literal">MATCH</code> clause allows you to specify the patterns Cypher will search for in the database, and
it is the primary way of getting data into the current set of bindings.
It is worth reading up more on the specification of the patterns themselves in <a class="xref" href="introduction-pattern.html" title="8.8. Patterns">Section 8.8, “Patterns”</a>.</p>
<p>It is often coupled to a <code class="literal">WHERE</code> clause which adds restrictions, or predicates, to the <code class="literal">MATCH</code> patterns, making them more specific.
The predicates are part of the pattern description, not a filter applied after the matching is done.
This means that <code class="literal">WHERE</code> should always be put together with the <code class="literal">MATCH</code> clause it belongs to.</p>
<p><code class="literal">MATCH</code> can occur at the beginning of the query or later, possibly after a <code class="literal">WITH</code>.
If it is the first, nothing will have been bound yet,
and Cypher will design a search to find the results matching the clause and any associated predicates specified in any <code class="literal">WHERE</code> clause.
This could involve a scan of the database, a search for nodes of a certain label,
or a search of an index to find starting points for the pattern matching.
Nodes and relationships found by this search are available as <span class="emphasis"><em>bound pattern elements</em></span>, and can be used for pattern matching of sub-graphs,
as well as used in any further <code class="literal">MATCH</code> clauses, where Cypher will use the known elements, and from there find further unknown elements.</p>
<p>Cypher is declarative, and so usually the query itself does not specify the algorithm to use to perform the search.
Cypher will automatically work out the best approach to finding start nodes and matching patterns.
Predicates in <code class="literal">WHERE</code> clauses can be evaluated before pattern matching, during pattern matching, or after finding matches.
However, there are cases where you can influence the decisions taken by the query compiler.
Read more about indexes in <a class="xref" href="query-schema-index.html" title="13.1. Indexes">Section 13.1, “Indexes”</a>, and more about the specifying index hints to force Cypher to use a specific index in <a class="xref" href="query-using.html" title="9.8. Using">Section 9.8, “Using”</a>.</p>
<div class="admonitionblock Tip"><table><tr><td class="icon"><img alt="[Tip]" src="images/icons/admon/tip.svg" /></td><td class="content"><b>Tip</b><p>To understand more about the patterns used in the <code class="literal">MATCH</code> clause, read <a class="xref" href="introduction-pattern.html" title="8.8. Patterns">Section 8.8, “Patterns”</a>.</p></td></tr></table></div>
<p>The following graph is used for the examples below:</p>
<div class="figure" id="d5e6511"><p class="title"><strong>Figure 10.1. Graph</strong></p><div class="figure-contents">
<a class="ulink" href="images/cypher-match-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-match-graph.svg" alt="cypher-match-graph.svg" /></span>
</a>
</div></div>
</section>
<section class="section" id="_basic_node_finding"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Basic node finding</h3></div></div></div>

<section class="section" id="match-get-all-nodes"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Get all nodes</h4></div></div></div>

<p>By just specifying a pattern with a single node and no labels, all nodes in the graph will be returned.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n</pre><p>
</p>
<p>Returns all the nodes in the database.</p>
<div class="queryresult table" id="d5e6529"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>7 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"Oliver Stone"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"Martin Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[3]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td><p><code class="literal">Node[5]{name:"Rob Reiner"}</code></p></td></tr><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (n) return n</strong></span></p>
</section>
<section class="section" id="match-get-all-nodes-with-a-label"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Get all nodes with a label</h4></div></div></div>

<p>Getting all nodes with a label on them is done with a single node pattern where the node has a label on it.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (movie:Movie)
RETURN movie</pre><p>
</p>
<p>Returns all the movies in the database.</p>
<div class="queryresult table" id="d5e6581"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[3]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (movie:Movie) return movie</strong></span></p>
</section>
<section class="section" id="match-related-nodes"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Related nodes</h4></div></div></div>

<p>The symbol <code class="literal">--</code> means <span class="emphasis"><em>related to,</em></span> without regard to type or direction of the relationship.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (director { name:'Oliver Stone' })--(movie)
RETURN movie.title</pre><p>
</p>
<p>Returns all the movies directed by Oliver Stone.</p>
<div class="queryresult table" id="d5e6615"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Wall Street"</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (director {name:'Oliver Stone'})--(movie) return movie.title</strong></span></p>
</section>
<section class="section" id="match-match-with-labels"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Match with labels</h4></div></div></div>

<p>To constrain your pattern with labels on nodes, you add it to your pattern nodes, using the label syntax.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (charlie:Person { name:'Charlie Sheen' })--(movie:Movie)
RETURN movie</pre><p>
</p>
<p>Return any nodes connected with the <code class="literal">Person</code> Charlie that are labeled <code class="literal">Movie</code>.</p>
<div class="queryresult table" id="d5e6645"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (charlie:Person {name:'Charlie Sheen'})--(movie:Movie) return movie</strong></span></p>
</section>
</section>
<section class="section" id="_relationship_basics"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Relationship basics</h3></div></div></div>

<section class="section" id="match-outgoing-relationships"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Outgoing relationships</h4></div></div></div>

<p>When the direction of a relationship is interesting, it is shown by using <code class="literal">--&gt;</code> or <code class="literal">&lt;--</code>, like this:</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (martin { name:'Martin Sheen' })--&gt;(movie)
RETURN movie.title</pre><p>
</p>
<p>Returns nodes connected to Martin by outgoing relationships.</p>
<div class="queryresult table" id="d5e6677"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The American President"</code></p></td></tr><tr><td><p><code class="literal">"Wall Street"</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (martin {name:'Martin Sheen'})--&gt;(movie) return movie.title</strong></span></p>
</section>
<section class="section" id="match-directed-relationships-and-identifier"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Directed relationships and identifier</h4></div></div></div>

<p>If an identifier is needed, either for filtering on properties of the relationship, or to return the relationship, this is how you introduce the identifier.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (martin { name:'Martin Sheen' })-[r]-&gt;(movie)
RETURN r</pre><p>
</p>
<p>Returns all outgoing relationships from Martin.</p>
<div class="queryresult table" id="d5e6709"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">:ACTED_IN[3]{}</code></p></td></tr><tr><td><p><code class="literal">:ACTED_IN[1]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (martin {name:'Martin Sheen'})-[r]-&gt;(movie) return r</strong></span></p>
</section>
<section class="section" id="match-match-by-relationship-type"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Match by relationship type</h4></div></div></div>

<p>When you know the relationship type you want to match on, you can specify it by using a colon together with the relationship type.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (wallstreet { title:'Wall Street' })&lt;-[:ACTED_IN]-(actor)
RETURN actor</pre><p>
</p>
<p>Returns nodes that <code class="literal">ACTED_IN</code> Wall Street.</p>
<div class="queryresult table" id="d5e6742"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>actor</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"Martin Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (wallstreet {title:'Wall Street'})&lt;-[:ACTED_IN]-(actor) return actor</strong></span></p>
</section>
<section class="section" id="match-match-by-multiple-relationship-types"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Match by multiple relationship types</h4></div></div></div>

<p>To match on one of multiple types, you can specify this by chaining them together with the pipe symbol <code class="literal">|</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (wallstreet { title:'Wall Street' })&lt;-[:ACTED_IN|:DIRECTED]-(person)
RETURN person</pre><p>
</p>
<p>Returns nodes with a <code class="literal">ACTED_IN</code> or <code class="literal">DIRECTED</code> relationship to Wall Street.</p>
<div class="queryresult table" id="d5e6781"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>person</th></tr></thead><tfoot><tr><th>4 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"Martin Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (wallstreet {title:'Wall Street'})&lt;-[:ACTED_IN|:DIRECTED]-(person) return person</strong></span></p>
</section>
<section class="section" id="match-match-by-relationship-type-and-use-an-identifier"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Match by relationship type and use an identifier</h4></div></div></div>

<p>If you both want to introduce an identifier to hold the relationship, and specify the relationship type you want, just add them both, like this.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (wallstreet { title:'Wall Street' })&lt;-[r:ACTED_IN]-(actor)
RETURN r</pre><p>
</p>
<p>Returns nodes that <code class="literal">ACTED_IN</code> Wall Street.</p>
<div class="queryresult table" id="d5e6822"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">:ACTED_IN[2]{}</code></p></td></tr><tr><td><p><code class="literal">:ACTED_IN[1]{}</code></p></td></tr><tr><td><p><code class="literal">:ACTED_IN[0]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (wallstreet {title:'Wall Street'})&lt;-[r:ACTED_IN]-(actor) return r</strong></span></p>
</section>
</section>
<section class="section" id="_relationships_in_depth"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Relationships in depth</h3></div></div></div>

<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>Inside a single pattern, relationships will only be matched once.
You can read more about this in <a class="xref" href="cypherdoc-uniqueness.html" title="7.4. Uniqueness">Section 7.4, “Uniqueness”</a>.</p></td></tr></table></div>
<section class="section" id="match-relationship-types-with-uncommon-characters"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Relationship types with uncommon characters</h4></div></div></div>

<p>Sometime your database will have types with non-letter characters, or with spaces in them. Use <code class="literal">`</code> (backtick) to quote these.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name:'Rob Reiner' })-[r:`TYPE THAT HAS SPACE IN IT`]-&gt;()
RETURN r</pre><p>
</p>
<p>Returns a relationship of a type with spaces in it.</p>
<div class="queryresult table" id="d5e6864"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">:TYPE THAT HAS SPACE IN IT[8]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _5-[:`TYPE THAT HAS SPACE IN IT`]-&gt;_1
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (n {name:'Rob Reiner'})-[r:`TYPE THAT HAS SPACE IN IT`]-&gt;() return r</strong></span></p>
</section>
<section class="section" id="match-multiple-relationships"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Multiple relationships</h4></div></div></div>

<p>Relationships can be expressed by using multiple statements in the form of <code class="literal">()--()</code>, or they can be strung together, like this:</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (charlie { name:'Charlie Sheen' })-[:ACTED_IN]-&gt;(movie)&lt;-[:DIRECTED]-(director)
RETURN charlie,movie,director</pre><p>
</p>
<p>Returns the three nodes in the path.</p>
<div class="queryresult table" id="d5e6893"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>charlie</th><th>movie</th><th>director</th></tr></thead><tfoot><tr><th colspan="3">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td><td><p><code class="literal">Node[0]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (charlie {name:'Charlie Sheen'})-[:ACTED_IN]-&gt;(movie)&lt;-[:DIRECTED]-(director) return charlie,movie,director</strong></span></p>
</section>
<section class="section" id="match-variable-length-relationships"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Variable length relationships</h4></div></div></div>

<p>Nodes that are a variable number of relationship→node hops away can be found using the following syntax: <code class="literal">-[:TYPE*minHops..maxHops]-&gt;</code>. minHops and maxHops are optional and default to 1 and infinity respectively. When no bounds are given the dots may be omitted.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (martin { name:"Martin Sheen" })-[:ACTED_IN*1..2]-(x)
RETURN x</pre><p>
</p>
<p>Returns nodes that are 1 or 2 relationships away from Martin.</p>
<div class="queryresult table" id="d5e6932"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>x</th></tr></thead><tfoot><tr><th>5 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[3]{name:"TheAmericanPresident",title:"The American President"}</code></p></td></tr><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (martin {name:"Martin Sheen"})-[:ACTED_IN*1..2]-(x) return x</strong></span></p>
</section>
<section class="section" id="match-relationship-identifier-in-variable-length-relationships"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Relationship identifier in variable length relationships</h4></div></div></div>

<p>When the connection between two nodes is of variable length, a relationship identifier becomes an collection of relationships.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (actor { name:'Charlie Sheen' })-[r:ACTED_IN*2]-(co_actor)
RETURN r</pre><p>
</p>
<p>The query returns a collection of relationships.</p>
<div class="queryresult table" id="d5e6976"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">[:ACTED_IN[0]{},:ACTED_IN[2]{}]</code></p></td></tr><tr><td><p><code class="literal">[:ACTED_IN[0]{},:ACTED_IN[1]{}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (actor {name:'Charlie Sheen'})-[r:ACTED_IN*2]-(co_actor) return r</strong></span></p>
</section>
<section class="section" id="match-match-with-properties-on-a-variable-length-path"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Match with properties on a variable length path</h4></div></div></div>

<p>A variable length relationship with properties defined on in it means that all relationships in the path
must have the property set to the given value. In this query, there are two paths between Charile Sheen and his
dad Martin Sheen. One of the includes a “blocked” relationship and the other doesn’t.
In this case we first alter the original graph by using the following query to add “blocked” and “unblocked” relationships:</p>
<pre class="programlisting" data-lang="cypher">MATCH (charlie:Person { name:'Charlie Sheen' }),(martin:Person { name:'Martin Sheen' })
CREATE (charlie)-[:X { blocked:false }]-&gt;(:Unblocked)&lt;-[:X { blocked:false }]-(martin)
CREATE (charlie)-[:X { blocked:true }]-&gt;(:Blocked)&lt;-[:X { blocked:false }]-(martin);</pre>
<p>This means that we are starting out with the following graph:</p>
<div class="informalfigure">
<a class="ulink" href="images/match-match-with-properties-on-a-variable-length-path.preparation-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/match-match-with-properties-on-a-variable-length-path.preparation-graph.svg" alt="match-match-with-properties-on-a-variable-length-path.preparation-graph.svg" /></span>
</a>
</div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p =(charlie:Person)-[* { blocked:false }]-(martin:Person)
WHERE charlie.name = 'Charlie Sheen' AND martin.name = 'Martin Sheen'
RETURN p</pre><p>
</p>
<p>Returns the paths between Charlie and Martin Sheen where all relationships have the <code class="literal">blocked</code> property set to <code class="literal">FALSE</code>.</p>
<div class="queryresult table" id="d5e7019"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[1]{name:"Charlie Sheen"},:X[8]{blocked:false},Node[7]{},:X[9]{blocked:false},Node[2]{name:"Martin Sheen"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 MATCH p = (charlie:Person)-[* {blocked:false}]-(martin:Person) WHERE charlie.name = 'Charlie Sheen' AND martin.name = 'Martin Sheen' RETURN p</strong></span></p>
</section>
<section class="section" id="match-zero-length-paths"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Zero length paths</h4></div></div></div>

<p>Using variable length paths that have the lower bound zero means that two identifiers can point to the same node. If the distance between two nodes is zero, they are by definition the same node. Note that when matching zero length paths the result may contain a match even when matching on a relationship type not in use.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (wallstreet:Movie { title:'Wall Street' })-[*0..1]-(x)
RETURN x</pre><p>
</p>
<p>Returns all nodes that are zero or one relationships away from Wall Street.</p>
<div class="queryresult table" id="d5e7047"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>x</th></tr></thead><tfoot><tr><th>5 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td><p><code class="literal">Node[6]{name:"Michael Douglas"}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"Martin Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (wallstreet:Movie {title:'Wall Street'})-[*0..1]-(x) return x</strong></span></p>
</section>
<section class="section" id="match-named-path"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Named path</h4></div></div></div>

<p>If you want to return or filter on a path in your pattern graph, you can a introduce a named path.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p =(michael { name:'Michael Douglas' })--&gt;()
RETURN p</pre><p>
</p>
<p>Returns the two paths starting from Michael.</p>
<div class="queryresult table" id="d5e7091"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[6]{name:"Michael Douglas"},:ACTED_IN[4]{},Node[3]{name:"TheAmericanPresident",title:"The American President"}]</code></p></td></tr><tr><td><p><code class="literal">[Node[6]{name:"Michael Douglas"},:ACTED_IN[2]{},Node[4]{name:"WallStreet",title:"Wall Street"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match p = (michael {name:'Michael Douglas'})--&gt;() return p</strong></span></p>
</section>
<section class="section" id="match-matching-on-a-bound-relationship"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Matching on a bound relationship</h4></div></div></div>

<p>When your pattern contains a bound relationship, and that relationship pattern doesn’t specify direction,
Cypher will try to match the relationship in both directions.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a)-[r]-(b)
WHERE id(r)= 0
RETURN a,b</pre><p>
</p>
<p>This returns the two connected nodes, once as the start node, and once as the end node.</p>
<div class="queryresult table" id="d5e7123"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>a</th><th>b</th></tr></thead><tfoot><tr><th colspan="2">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td></tr><tr><td><p><code class="literal">Node[4]{name:"WallStreet",title:"Wall Street"}</code></p></td><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match (a)-[r]-(b) where id(r) = 0 return a,b</strong></span></p>
</section>
</section>
<section class="section" id="_shortest_path"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Shortest path</h3></div></div></div>

<section class="section" id="match-single-shortest-path"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Single shortest path</h4></div></div></div>

<p>Finding a single shortest path between two nodes is as easy as using the <code class="literal">shortestPath</code> function. It’s done like this:</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (martin:Person { name:"Martin Sheen" }),(oliver:Person { name:"Oliver Stone" }),
  p = shortestPath((martin)-[*..15]-(oliver))
RETURN p</pre><p>
</p>
<p>This means: find a single shortest path between two nodes, as long as the path is max 15 relationships long. Inside of the parentheses
 you define a single link of a path — the starting node, the connecting relationship and the end node. Characteristics describing the relationship
 like relationship type, max hops and direction are all used when finding the shortest path. You can also mark the path as optional.</p>
<div class="queryresult table" id="d5e7166"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[2]{name:"Martin Sheen"},:ACTED_IN[1]{},Node[4]{name:"WallStreet",title:"Wall Street"},:DIRECTED[5]{},Node[0]{name:"Oliver Stone"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>

 match (martin:Person {name:"Martin Sheen"} ),
       (oliver:Person {name:"Oliver Stone"}),
       p = shortestPath( (martin)-[*..15]-(oliver) )
 return p</strong></span></p>
</section>
<section class="section" id="match-all-shortest-paths"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">All shortest paths</h4></div></div></div>

<p>Finds all the shortest paths between two nodes.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (martin:Person { name:"Martin Sheen" }),(michael:Person { name:"Michael Douglas" }),
  p = allShortestPaths((martin)-[*]-(michael))
RETURN p</pre><p>
</p>
<p>Finds the two shortest paths between Martin and Michael.</p>
<div class="queryresult table" id="d5e7194"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[2]{name:"Martin Sheen"},:ACTED_IN[3]{},Node[3]{name:"TheAmericanPresident",title:"The American President"},:ACTED_IN[4]{},Node[6]{name:"Michael Douglas"}]</code></p></td></tr><tr><td><p><code class="literal">[Node[2]{name:"Martin Sheen"},:ACTED_IN[1]{},Node[4]{name:"WallStreet",title:"Wall Street"},:ACTED_IN[2]{},Node[6]{name:"Michael Douglas"}]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>

 match (martin:Person {name:"Martin Sheen"} ),
       (michael:Person {name:"Michael Douglas"}),
       p = allShortestPaths( (martin)-[*]-(michael) ) return p</strong></span></p>
</section>
</section>
<section class="section" id="_get_node_or_relationship_by_id"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Get node or relationship by id</h3></div></div></div>

<section class="section" id="match-node-by-id"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Node by id</h4></div></div></div>

<p>Search for nodes by id can be done with the <span class="emphasis"><em>id</em></span> function in a predicate.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>Neo4j reuses its internal ids when nodes and relationships are deleted.
This means that applications using, and relying on internal Neo4j ids, are brittle or at risk of making mistakes.
Rather use application generated ids.</p></td></tr></table></div>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH n
WHERE id(n)= 1
RETURN n</pre><p>
</p>
<p>The corresponding node is returned.</p>
<div class="queryresult table" id="d5e7231"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match n where id(n) = 1 return n</strong></span></p>
</section>
<section class="section" id="match-relationship-by-id"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Relationship by id</h4></div></div></div>

<p>Search for nodes by id can be done with the <span class="emphasis"><em>id</em></span> function in a predicate.</p>
<p>This is not recommended practice. See <a class="xref" href="query-match.html#match-node-by-id" title="Node by id">the section called “Node by id”</a> for more information on the use of Neo4j ids.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH ()-[r]-&gt;()
WHERE id(r)= 0
RETURN r</pre><p>
</p>
<p>The relationship with id <code class="literal">0</code> is returned.</p>
<div class="queryresult table" id="d5e7263"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">:ACTED_IN[0]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match ()-[r]-&gt;() where id(r) = 0 return r</strong></span></p>
</section>
<section class="section" id="match-multiple-nodes-by-id"><div xmlns="" class="titlepage"><div><div><h4 xmlns="http://www.w3.org/1999/xhtml" class="title">Multiple nodes by id</h4></div></div></div>

<p>Multiple nodes are selected by specifying them in an IN clause.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH n
WHERE id(n) IN [1, 2, 0]
RETURN n</pre><p>
</p>
<p>This returns the nodes listed in the <code class="literal">IN</code> expression.</p>
<div class="queryresult table" id="d5e7292"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"Charlie Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"Martin Sheen"}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"Oliver Stone"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live </strong><span class="database">create (_0:`Person` {`name`:"Oliver Stone"})
create (_1:`Person` {`name`:"Charlie Sheen"})
create (_2:`Person` {`name`:"Martin Sheen"})
create (_3:`Movie` {`name`:"TheAmericanPresident", `title`:"The American President"})
create (_4:`Movie` {`name`:"WallStreet", `title`:"Wall Street"})
create (_5:`Person` {`name`:"Rob Reiner"})
create (_6:`Person` {`name`:"Michael Douglas"})
create _0-[:`DIRECTED`]-&gt;_4
create _1-[:`ACTED_IN`]-&gt;_4
create _1-[:`FATHER`]-&gt;_2
create _2-[:`ACTED_IN`]-&gt;_3
create _2-[:`ACTED_IN`]-&gt;_4
create _5-[:`DIRECTED`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_3
create _6-[:`ACTED_IN`]-&gt;_4
</span><span class="command"><strong>
 match n where id(n) in [1, 2, 0] return n</strong></span></p>
</section>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>