<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>16.4. Row operators -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="execution-plans-combining.html" title="16.3. Combining operators" /><link rel="next" href="execution-plans-update.html" title="16.5. Update Operators" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="16.4. Row operators" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-77944";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.5.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>16.4. Row operators</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="execution-plans-combining.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="execution-plans.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="execution-plans-update.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="execution-plans-row-operators"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">16.4. Row operators</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-distinct">Distinct</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-eager-aggregation">Eager Aggregation</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-filter">Filter</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-limit">Limit</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-projection">Projection</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-skip">Skip</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-sort">Sort</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-top">Top</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-union">Union</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-unwind">Unwind</a></span></li></ul></div>

<p>These operators take rows produced by another operator and transform them to a different set of rows</p>
<section class="section" id="query-plan-distinct"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Distinct</h3></div></div></div>

<p>Removes duplicate rows.
The following query will return unique locations that have people working in them</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (l:Location)&lt;-[:WORKS_IN]-(p:Person)
RETURN DISTINCT l</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+----------------+----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers    | Other                |
+------------------+----------------+------+---------+----------------+----------------------+
| +ProduceResults  |              4 |    1 |       0 | l              | l                    |
| |                +----------------+------+---------+----------------+----------------------+
| +Distinct        |              4 |    1 |       0 | l              | l                    |
| |                +----------------+------+---------+----------------+----------------------+
| +Filter          |              4 |    4 |       4 | anon[19], l, p | l:Location           |
| |                +----------------+------+---------+----------------+----------------------+
| +Expand(All)     |              4 |    4 |      10 | anon[19], l, p | (p)-[:WORKS_IN]-&gt;(l) |
| |                +----------------+------+---------+----------------+----------------------+
| +NodeByLabelScan |              6 |    6 |       7 | p              | :Person              |
+------------------+----------------+------+---------+----------------+----------------------+

Total database accesses: 21</pre><p>
</p>
</section>
<section class="section" id="query-plan-eager-aggregation"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Eager Aggregation</h3></div></div></div>

<p>Eagerly loads resulting sub graphs before starting to emit the aggregated results.
The following query will collect the people who work in every location before returning any rows.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (l:Location)&lt;-[:WORKS_IN]-(p:Person)
RETURN l.name AS location, COLLECT(p.name) AS people</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-------------------+----------------+------+---------+--------------------------+----------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Identifiers              | Other                |
+-------------------+----------------+------+---------+--------------------------+----------------------+
| +ProduceResults   |              2 |    1 |       0 | location, people         | location, people     |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +EagerAggregation |              2 |    1 |       4 | location, people         | location             |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Projection       |              4 |    4 |       4 | anon[19], l, location, p | l.name; p            |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Filter           |              4 |    4 |       4 | anon[19], l, p           | l:Location           |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Expand(All)      |              4 |    4 |      10 | anon[19], l, p           | (p)-[:WORKS_IN]-&gt;(l) |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +NodeByLabelScan  |              6 |    6 |       7 | p                        | :Person              |
+-------------------+----------------+------+---------+--------------------------+----------------------+

Total database accesses: 29</pre><p>
</p>
</section>
<section class="section" id="query-plan-filter"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Filter</h3></div></div></div>

<p>Filters each row coming from the child operator, only passing through rows that evaluate the predicates to <code class="literal">TRUE</code>.
The following query will look for nodes with the label <code class="literal">Person</code> and filter those whose name begins with the letter <code class="literal">a</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
WHERE p.name =~ "^a.*"
RETURN p</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+-----------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other                       |
+------------------+----------------+------+---------+-------------+-----------------------------+
| +ProduceResults  |              3 |    0 |       0 | p           | p                           |
| |                +----------------+------+---------+-------------+-----------------------------+
| +Projection      |              3 |    0 |       0 | p           | p                           |
| |                +----------------+------+---------+-------------+-----------------------------+
| +Filter          |              3 |    0 |       6 | p           | p.name ~= /{  AUTOSTRING0}/ |
| |                +----------------+------+---------+-------------+-----------------------------+
| +NodeByLabelScan |              6 |    6 |       7 | p           | :Person                     |
+------------------+----------------+------+---------+-------------+-----------------------------+

Total database accesses: 13</pre><p>
</p>
</section>
<section class="section" id="query-plan-limit"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Limit</h3></div></div></div>

<p>Returns the first <span class="emphasis"><em>n</em></span> rows.</p>
<p>The following query will return the first 3 people in an arbitrary order.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
LIMIT 3</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+--------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other        |
+------------------+----------------+------+---------+-------------+--------------+
| +ProduceResults  |              6 |    3 |       0 | p           | p            |
| |                +----------------+------+---------+-------------+--------------+
| +Projection      |              6 |    3 |       0 | p           | p            |
| |                +----------------+------+---------+-------------+--------------+
| +Limit           |              6 |    3 |       0 | p           | {  AUTOINT0} |
| |                +----------------+------+---------+-------------+--------------+
| +NodeByLabelScan |              6 |    3 |       4 | p           | :Person      |
+------------------+----------------+------+---------+-------------+--------------+

Total database accesses: 4</pre><p>
</p>
</section>
<section class="section" id="query-plan-projection"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Projection</h3></div></div></div>

<p>For each row from its input, projection executes a set of expressions and produces a row with the results of the expressions.
The following query will produce one row with the value "hello".</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">RETURN "hello" AS greeting</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other           |
+-----------------+----------------+------+---------+-------------+-----------------+
| +ProduceResults |              1 |    1 |       0 | greeting    | greeting        |
| |               +----------------+------+---------+-------------+-----------------+
| +Projection     |              1 |    1 |       0 | greeting    | {  AUTOSTRING0} |
+-----------------+----------------+------+---------+-------------+-----------------+

Total database accesses: 0</pre><p>
</p>
</section>
<section class="section" id="query-plan-skip"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Skip</h3></div></div></div>

<p>Skips <span class="emphasis"><em>n</em></span> rows</p>
<p>The following query will skip the person with the lowest <code class="literal">id</code> property and return the rest.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.id
SKIP 1</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                 |
+------------------+----------------+------+---------+--------------------------+-----------------------+
| +ProduceResults  |              6 |    5 |       0 | p                        | p                     |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |              6 |    5 |       0 | anon[35], anon[59], p, p | anon[35]              |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |              6 |    5 |       0 | anon[35], anon[59], p    | anon[35]; anon[59]    |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Skip            |              6 |    5 |       0 | anon[35], anon[59], p    | {  AUTOINT0}          |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Sort            |              6 |    6 |       0 | anon[35], anon[59], p    | anon[59]              |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |              6 |    6 |      12 | anon[35], anon[59], p    | anon[35]; anon[35].id |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |              6 |    6 |       0 | anon[35], p              | p                     |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +NodeByLabelScan |              6 |    6 |       7 | p                        | :Person               |
+------------------+----------------+------+---------+--------------------------+-----------------------+

Total database accesses: 19</pre><p>
</p>
</section>
<section class="section" id="query-plan-sort"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Sort</h3></div></div></div>

<p>Sorts rows by a provided key.</p>
<p>The following query will find all the people and return them sorted alphabetically by name.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.name</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                   |
+------------------+----------------+------+---------+--------------------------+-------------------------+
| +ProduceResults  |              6 |    6 |       0 | p                        | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       0 | anon[24], anon[37], p, p | anon[24]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       0 | anon[24], anon[37], p    | anon[24]; anon[37]      |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Sort            |              6 |    6 |       0 | anon[24], anon[37], p    | anon[37]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       6 | anon[24], anon[37], p    | anon[24]; anon[24].name |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       0 | anon[24], p              | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +NodeByLabelScan |              6 |    6 |       7 | p                        | :Person                 |
+------------------+----------------+------+---------+--------------------------+-------------------------+

Total database accesses: 13</pre><p>
</p>
</section>
<section class="section" id="query-plan-top"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Top</h3></div></div></div>

<p>Returns the first <span class="emphasis"><em>n</em></span> rows sorted by a provided key. The physical operator is called <code class="literal">Top</code>. Instead of sorting the whole input, only the top X rows are kept.</p>
<p>The following query will find the first 2 people sorted alphabetically by name.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.name
LIMIT 2</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                   |
+------------------+----------------+------+---------+--------------------------+-------------------------+
| +ProduceResults  |              6 |    2 |       0 | p                        | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    2 |       0 | anon[24], anon[37], p, p | anon[24]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    2 |       0 | anon[24], anon[37], p    | anon[24]; anon[37]      |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Top             |              6 |    2 |       0 | anon[24], anon[37], p    | {  AUTOINT0};           |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       6 | anon[24], anon[37], p    | anon[24]; anon[24].name |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              6 |    6 |       0 | anon[24], p              | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +NodeByLabelScan |              6 |    6 |       7 | p                        | :Person                 |
+------------------+----------------+------+---------+--------------------------+-------------------------+

Total database accesses: 13</pre><p>
</p>
</section>
<section class="section" id="query-plan-union"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Union</h3></div></div></div>

<p>Union concatenates the results from the right plan after the results of the left plan.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Location)
RETURN p.name
UNION ALL MATCH (p:Country)
RETURN p.name</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+-------------+-----------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers | Other     |
+--------------------+----------------+------+---------+-------------+-----------+
| +ProduceResults    |             10 |   11 |       0 | p.name      | p.name    |
| |                  +----------------+------+---------+-------------+-----------+
| +Union             |             10 |   11 |       0 | p.name      |           |
| |\                 +----------------+------+---------+-------------+-----------+
| | +Projection      |              1 |    1 |       1 | p, p.name   | p.name    |
| | |                +----------------+------+---------+-------------+-----------+
| | +NodeByLabelScan |              1 |    1 |       2 | p           | :Country  |
| |                  +----------------+------+---------+-------------+-----------+
| +Projection        |             10 |   10 |      10 | p, p.name   | p.name    |
| |                  +----------------+------+---------+-------------+-----------+
| +NodeByLabelScan   |             10 |   10 |      11 | p           | :Location |
+--------------------+----------------+------+---------+-------------+-----------+

Total database accesses: 24</pre><p>
</p>
</section>
<section class="section" id="query-plan-unwind"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Unwind</h3></div></div></div>

<p>Takes a collection of values and returns one row per item in the collection.
The following query will return one row for each of the numbers 1 to 5.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">UNWIND range(1,5) AS value
RETURN value;</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other |
+-----------------+----------------+------+---------+-------------+-------+
| +ProduceResults |             10 |    5 |       0 | value       | value |
| |               +----------------+------+---------+-------------+-------+
| +Projection     |             10 |    5 |       0 | value       | value |
| |               +----------------+------+---------+-------------+-------+
| +UNWIND         |             10 |    5 |       0 | value       |       |
| |               +----------------+------+---------+-------------+-------+
| +Argument       |              1 |    1 |       0 |             |       |
+-----------------+----------------+------+---------+-------------+-------+

Total database accesses: 0</pre><p>
</p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>