<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>4.4. Finding Paths -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypherdoc-social-movie-database.html" title="4.3. Social Movie Database" /><link rel="next" href="cypherdoc-labels.html" title="4.5. Labels, Constraints and Indexes" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="4.4. Finding Paths" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-68604";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<!-- Scrolling -->
<script type="text/javascript" src="common/jquery/jquery.kinetic.min.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>4.4. Finding Paths</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypherdoc-social-movie-database.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="tutorials-cypher.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypherdoc-labels.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-finding-paths"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">4.4. Finding Paths</h2></div></div></div>

<p>Our example graph consists of movies with title and year and actors with a name.
Actors have <code class="literal">ACTS_IN</code> relationships to movies, which represents the role they played.
This relationship also has a role attribute.</p>
<p>We queried and updated the data so far, now let’s <span class="emphasis"><em>find interesting constellations, a.k.a. paths</em></span>.</p>
<pre class="programlisting" data-lang="cypher">CREATE (matrix1:Movie { title : 'The Matrix', year : '1999-03-31' })
CREATE (matrix2:Movie { title : 'The Matrix Reloaded', year : '2003-05-07' })
CREATE (matrix3:Movie { title : 'The Matrix Revolutions', year : '2003-10-27' })
CREATE (keanu:Actor { name:'Keanu Reeves' })
CREATE (laurence:Actor { name:'Laurence Fishburne' })
CREATE (carrieanne:Actor { name:'Carrie-Anne Moss' })
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix1)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix2)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix3)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix1)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix2)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix3)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix1)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix2)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix3)</pre>
<p class="cypherdoc-console"></p>
<p>All other movies that actors in “The Matrix” acted in ordered by occurrence:</p>
<pre class="programlisting" data-lang="cypher">MATCH (:Movie { title: "The Matrix" })&lt;-[:ACTS_IN]-(actor)-[:ACTS_IN]-&gt;(movie)
RETURN movie.title, count(*)
ORDER BY count(*) DESC ;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th><th>count(*)</th></tr></thead><tfoot><tr><th colspan="2">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix Revolutions"</code></p></td><td><p><code class="literal">3</code></p></td></tr><tr><td><p><code class="literal">"The Matrix Reloaded"</code></p></td><td><p><code class="literal">3</code></p></td></tr></tbody></table></div>
<p>Let’s see who acted in each of these movies:</p>
<pre class="programlisting" data-lang="cypher">MATCH (:Movie { title: "The Matrix" })&lt;-[:ACTS_IN]-(actor)-[:ACTS_IN]-&gt;(movie)
RETURN movie.title, collect(actor.name), count(*) AS count
ORDER BY count DESC ;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th><th>collect(actor.name)</th><th>count</th></tr></thead><tfoot><tr><th colspan="3">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix Revolutions"</code></p></td><td><p><code class="literal">["Carrie-Anne Moss","Laurence Fishburne","Keanu Reeves"]</code></p></td><td><p><code class="literal">3</code></p></td></tr><tr><td><p><code class="literal">"The Matrix Reloaded"</code></p></td><td><p><code class="literal">["Carrie-Anne Moss","Laurence Fishburne","Keanu Reeves"]</code></p></td><td><p><code class="literal">3</code></p></td></tr></tbody></table></div>
<p>What about co-acting, that is actors that acted together:</p>
<pre class="programlisting" data-lang="cypher">MATCH (:Movie { title: "The Matrix"
  })&lt;-[:ACTS_IN]-(actor)-[:ACTS_IN]-&gt;(movie)&lt;-[:ACTS_IN]-(colleague)
RETURN actor.name, collect(DISTINCT colleague.name);</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>actor.name</th><th>collect(distinct colleague.name)</th></tr></thead><tfoot><tr><th colspan="2">3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Carrie-Anne Moss"</code></p></td><td><p><code class="literal">["Laurence Fishburne","Keanu Reeves"]</code></p></td></tr><tr><td><p><code class="literal">"Keanu Reeves"</code></p></td><td><p><code class="literal">["Carrie-Anne Moss","Laurence Fishburne"]</code></p></td></tr><tr><td><p><code class="literal">"Laurence Fishburne"</code></p></td><td><p><code class="literal">["Carrie-Anne Moss","Keanu Reeves"]</code></p></td></tr></tbody></table></div>
<p>Who of those other actors acted most often with anyone from the matrix cast?</p>
<pre class="programlisting" data-lang="cypher">MATCH (:Movie { title: "The Matrix"
  })&lt;-[:ACTS_IN]-(actor)-[:ACTS_IN]-&gt;(movie)&lt;-[:ACTS_IN]-(colleague)
RETURN colleague.name, count(*)
ORDER BY count(*) DESC LIMIT 10;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>colleague.name</th><th>count(*)</th></tr></thead><tfoot><tr><th colspan="2">3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Carrie-Anne Moss"</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">"Keanu Reeves"</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">"Laurence Fishburne"</code></p></td><td><p><code class="literal">4</code></p></td></tr></tbody></table></div>
<p>Starting with paths, a path is a sequence of nodes and relationships from a start node to an end node.</p>
<p>We know that Trinity loves Neo, but how many paths exist between the two actors?
We’ll limit the path length of the pattern as it exhaustively searches the graph otherwise.
This is done by using <code class="literal">*0..5</code> in the pattern relationship.</p>
<pre class="programlisting" data-lang="cypher">MATCH p =(:Actor { name: "Keanu Reeves" })-[:ACTS_IN*0..5]-(:Actor { name: "Carrie-Anne Moss" })
RETURN p, length(p)
LIMIT 10;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th><th>length(p)</th></tr></thead><tfoot><tr><th colspan="2">9 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[6]{role:"Trinity"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[0]{role:"Neo"},Node[0]{title:"The Matrix",year:"1999-03-31"}]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[6]{role:"Trinity"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[3]{role:"Morpheus"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[4]{role:"Morpheus"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[1]{role:"Neo"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[6]{role:"Trinity"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[3]{role:"Morpheus"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[5]{role:"Morpheus"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[2]{role:"Neo"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[7]{role:"Trinity"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[1]{role:"Neo"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[7]{role:"Trinity"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[4]{role:"Morpheus"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[3]{role:"Morpheus"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[0]{role:"Neo"},Node[0]{title:"The Matrix",year:"1999-03-31"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[7]{role:"Trinity"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[4]{role:"Morpheus"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[5]{role:"Morpheus"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[2]{role:"Neo"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[8]{role:"Trinity"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[2]{role:"Neo"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[8]{role:"Trinity"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[5]{role:"Morpheus"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[3]{role:"Morpheus"},Node[0]{title:"The Matrix",year:"1999-03-31"},:ACTS_IN[0]{role:"Neo"},Node[0]{title:"The Matrix",year:"1999-03-31"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">[Node[3]{name:"Keanu Reeves"},:ACTS_IN[8]{role:"Trinity"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[5]{role:"Morpheus"},Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"},:ACTS_IN[4]{role:"Morpheus"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"},:ACTS_IN[1]{role:"Neo"},Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}]</code></p></td><td><p><code class="literal">4</code></p></td></tr></tbody></table></div>
<p>But that’s a lot of data, we just want to look at the names and titles of the nodes of the path.</p>
<pre class="programlisting" data-lang="cypher">MATCH p =(:Actor { name: "Keanu Reeves" })-[:ACTS_IN*0..5]-(:Actor { name: "Carrie-Anne Moss" })
RETURN extract(n IN nodes(p)| coalesce(n.title,n.name)) AS `names AND titles`, length(p)
ORDER BY length(p)
LIMIT 10;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>names and titles</th><th>length(p)</th></tr></thead><tfoot><tr><th colspan="2">9 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">["Keanu Reeves","The Matrix","The Matrix"]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Reloaded","The Matrix Reloaded"]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Revolutions","The Matrix Revolutions"]</code></p></td><td><p><code class="literal">2</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix","The Matrix","The Matrix Reloaded","The Matrix Reloaded"]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix","The Matrix","The Matrix Revolutions","The Matrix Revolutions"]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Reloaded","The Matrix Reloaded","The Matrix","The Matrix"]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Reloaded","The Matrix Reloaded","The Matrix Revolutions","The Matrix Revolutions"]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Revolutions","The Matrix Revolutions","The Matrix","The Matrix"]</code></p></td><td><p><code class="literal">4</code></p></td></tr><tr><td><p><code class="literal">["Keanu Reeves","The Matrix Revolutions","The Matrix Revolutions","The Matrix Reloaded","The Matrix Reloaded"]</code></p></td><td><p><code class="literal">4</code></p></td></tr></tbody></table></div>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>