<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>9.1. Return -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="next" href="query-order.html" title="9.2. Order by" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="9.1. Return" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-68604";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<!-- Scrolling -->
<script type="text/javascript" src="common/jquery/jquery.kinetic.min.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>9.1. Return</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-general.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-general.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-order.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-return"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">9.1. Return</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-return.html#return-return-nodes">Return nodes</a></span></li><li><span class="section"><a href="query-return.html#return-return-relationships">Return relationships</a></span></li><li><span class="section"><a href="query-return.html#return-return-property">Return property</a></span></li><li><span class="section"><a href="query-return.html#return-return-all-elements">Return all elements</a></span></li><li><span class="section"><a href="query-return.html#return-identifier-with-uncommon-characters">Identifier with uncommon characters</a></span></li><li><span class="section"><a href="query-return.html#return-column-alias">Column alias</a></span></li><li><span class="section"><a href="query-return.html#return-optional-properties">Optional properties</a></span></li><li><span class="section"><a href="query-return.html#return-other-expressions">Other expressions</a></span></li><li><span class="section"><a href="query-return.html#return-unique-results">Unique results</a></span></li></ul></div>

<p>In the <code class="literal">RETURN</code> part of your query, you define which parts of the pattern you are
interested in. It can be nodes, relationships, or properties on these.</p>
<div class="figure" id="d5e5429"><p class="title"><strong>Figure 9.1. Graph</strong></p><div class="figure-contents">
<a class="ulink" href="images/cypher-return-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-return-graph.svg" alt="cypher-return-graph.svg" /></span>
</a>
</div></div>
<section class="section" id="return-return-nodes"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Return nodes</h3></div></div></div>

<p>To return a node, list it in the <code class="literal">RETURN</code> statement.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: "B" })
RETURN n</pre><p>
</p>
<p>The example will return the node.</p>
<div class="queryresult table" id="d5e5446"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"B"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (n {name: "B"}) return n</strong></span></p>
</section>
<section class="section" id="return-return-relationships"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Return relationships</h3></div></div></div>

<p>To return a relationship, just include it in the <code class="literal">RETURN</code> list.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: "A" })-[r:KNOWS]-&gt;(c)
RETURN r</pre><p>
</p>
<p>The relationship is returned by the example.</p>
<div class="queryresult table" id="d5e5475"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>r</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">:KNOWS[0]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (n {name: "A"})-[r:KNOWS]-&gt;(c) return r</strong></span></p>
</section>
<section class="section" id="return-return-property"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Return property</h3></div></div></div>

<p>To return a property, use the dot separator, like this:</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n { name: "A" })
RETURN n.name</pre><p>
</p>
<p>The value of the property <code class="literal">name</code> gets returned.</p>
<div class="queryresult table" id="d5e5504"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n.name</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"A"</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (n {name: "A"}) return n.name</strong></span></p>
</section>
<section class="section" id="return-return-all-elements"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Return all elements</h3></div></div></div>

<p>When you want to return all nodes, relationships and paths found in a query, you can use the <code class="literal">*</code> symbol.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH p=(a { name: "A" })-[r]-&gt;(b)
RETURN *</pre><p>
</p>
<p>This returns the two nodes, the relationship and the path used in the query.</p>
<div class="queryresult table" id="d5e5533"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>a</th><th>b</th><th>p</th><th>r</th></tr></thead><tfoot><tr><th colspan="4">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"A",happy:"Yes!",age:55}</code></p></td><td><p><code class="literal">Node[1]{name:"B"}</code></p></td><td><p><code class="literal">[Node[0]{name:"A",happy:"Yes!",age:55},:KNOWS[0]{},Node[1]{name:"B"}]</code></p></td><td><p><code class="literal">:KNOWS[0]{}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"A",happy:"Yes!",age:55}</code></p></td><td><p><code class="literal">Node[1]{name:"B"}</code></p></td><td><p><code class="literal">[Node[0]{name:"A",happy:"Yes!",age:55},:BLOCKS[1]{},Node[1]{name:"B"}]</code></p></td><td><p><code class="literal">:BLOCKS[1]{}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match p=(a {name: "A"})-[r]-&gt;(b) return *</strong></span></p>
</section>
<section class="section" id="return-identifier-with-uncommon-characters"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Identifier with uncommon characters</h3></div></div></div>

<p>To introduce a placeholder that is made up of characters that are
      outside of the english alphabet, you can use the <code class="literal">`</code> to enclose the identifier, like this:</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (`This isn't a common identifier`)
WHERE `This isn't a common identifier`.name='A'
RETURN `This isn't a common identifier`.happy</pre><p>
</p>
<p>The node with name "A" is returned</p>
<div class="queryresult table" id="d5e5590"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>`This isn't a common identifier`.happy</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Yes!"</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (`This isn't a common identifier`) where `This isn't a common identifier`.name='A'
 return `This isn't a common identifier`.happy</strong></span></p>
</section>
<section class="section" id="return-column-alias"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Column alias</h3></div></div></div>

<p>If the name of the column should be different from the expression used, you can rename it by using <code class="literal">AS</code> &lt;new name&gt;.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a { name: "A" })
RETURN a.age AS SomethingTotallyDifferent</pre><p>
</p>
<p>Returns the age property of a node, but renames the column.</p>
<div class="queryresult table" id="d5e5619"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>SomethingTotallyDifferent</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">55</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (a {name: "A"}) return a.age AS SomethingTotallyDifferent</strong></span></p>
</section>
<section class="section" id="return-optional-properties"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Optional properties</h3></div></div></div>

<p>If a property might or might not be there, you can still select it as usual. It will be treated as <code class="literal">NULL</code> if it is missing</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n.age</pre><p>
</p>
<p>This example returns the age when the node has that property, or <code class="literal">null</code> if the property is not there.</p>
<div class="queryresult table" id="d5e5649"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n.age</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">55</code></p></td></tr><tr><td><p><code class="literal">&lt;null&gt;</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (n) return n.age</strong></span></p>
</section>
<section class="section" id="return-other-expressions"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Other expressions</h3></div></div></div>

<p>Any expression can be used as a return item — literals, predicates, properties, functions, and everything else.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a { name: "A" })
RETURN a.age &gt; 30, "I'm a literal",(a)--&gt;()</pre><p>
</p>
<p>Returns a predicate, a literal and function call with a pattern expression parameter.</p>
<div class="queryresult table" id="d5e5681"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>a.age &gt; 30</th><th>"I'm a literal"</th><th>(a)--&gt;()</th></tr></thead><tfoot><tr><th colspan="3">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">true</code></p></td><td><p><code class="literal">"I'm a literal"</code></p></td><td><p><code class="literal">[[Node[0]{name:"A",happy:"Yes!",age:55},:KNOWS[0]{},Node[1]{name:"B"}],[Node[0]{name:"A",happy:"Yes!",age:55},:BLOCKS[1]{},Node[1]{name:"B"}]]</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (a {name: "A"}) return a.age &gt; 30, "I'm a literal", (a)--&gt;()</strong></span></p>
</section>
<section class="section" id="return-unique-results"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Unique results</h3></div></div></div>

<p><code class="literal">DISTINCT</code> retrieves only unique rows depending on the columns that have been selected to output.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (a { name: "A" })--&gt;(b)
RETURN DISTINCT b</pre><p>
</p>
<p>The node named B is returned by the query, but only once.</p>
<div class="queryresult table" id="d5e5720"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>b</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[1]{name:"B"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:55, `happy`:"Yes!", `name`:"A"})
create (_1 {`name`:"B"})
create _0-[:`KNOWS`]-&gt;_1
create _0-[:`BLOCKS`]-&gt;_1
</span><span class="command"><strong>
 match (a {name: "A"})--&gt;(b) return distinct b</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>