<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>13.1. Indexes -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="next" href="query-constraints.html" title="13.2. Constraints" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="13.1. Indexes" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-68604";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>13.1. Indexes</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypher-schema.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="cypher-schema.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-constraints.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-schema-index"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">13.1. Indexes</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-schema-index.html#schema-index-create-index-on-a-label">Create index on a label</a></span></li><li><span class="section"><a href="query-schema-index.html#schema-index-drop-index-on-a-label">Drop index on a label</a></span></li><li><span class="section"><a href="query-schema-index.html#schema-index-use-index">Use index</a></span></li><li><span class="section"><a href="query-schema-index.html#schema-index-use-index-with-where">Use index with WHERE</a></span></li><li><span class="section"><a href="query-schema-index.html#schema-index-use-index-with-in">Use index with IN</a></span></li></ul></div>

<p>Cypher allows the creation of indexes over a property for all nodes that have a given label.
These indexes are automatically managed and kept up to date by the database whenever the graph is changed.</p>
<section class="section" id="schema-index-create-index-on-a-label"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Create index on a label</h3></div></div></div>

<p>To create an index on a property for all nodes that have a label, use <code class="literal">CREATE</code> <code class="literal">INDEX</code> <code class="literal">ON</code>. Note that the index is not immediately available, but will be created in the background. See <a class="xref" href="graphdb-neo4j-schema.html#graphdb-neo4j-schema-indexes" title="Indexes">the section called “Indexes”</a> for details.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">CREATE INDEX ON :Person(name)</pre><p>
</p>
<div class="queryresult table" id="d5e13088"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><tbody><tr><td class="emptyresult"><p><code class="literal">(empty result)</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Person`(`name`)
create (_0:`Person` {`name`:"Andres"})
create (_1:`Person` {`name`:"Mark"})
create _0-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 create index on :Person(name)</strong></span></p>
</section>
<section class="section" id="schema-index-drop-index-on-a-label"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Drop index on a label</h3></div></div></div>

<p>To drop an index on all nodes that have a label, use the <code class="literal">DROP</code> <code class="literal">INDEX</code> clause.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">DROP INDEX ON :Person(name)</pre><p>
</p>
<div class="queryresult table" id="d5e13111"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><tfoot><tr><th>Indexes removed: 1</th></tr></tfoot><tbody><tr><td class="emptyresult"><p><code class="literal">(empty result)</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Person`(`name`)
create (_0:`Person` {`name`:"Andres"})
create (_1:`Person` {`name`:"Mark"})
create _0-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 drop index on :Person(name)</strong></span></p>
</section>
<section class="section" id="schema-index-use-index"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Use index</h3></div></div></div>

<p>There is usually no need to specify which indexes to use in a query, Cypher will figure that out by itself. For example the query below will use the <code class="literal">Person(name)</code> index, if it exists. If you for some reason want to hint to specific indexes, see <a class="xref" href="query-using.html" title="9.8. Using">Section 9.8, “Using”</a>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (person:Person { name: 'Andres' })
RETURN person</pre><p>
</p>
<div class="queryresult table" id="d5e13137"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>person</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"Andres"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Person`(`name`)
create (_0:`Person` {`name`:"Andres"})
create (_1:`Person` {`name`:"Mark"})
create _0-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (person:Person {name: 'Andres'}) return person</strong></span></p>
</section>
<section class="section" id="schema-index-use-index-with-where"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Use index with WHERE</h3></div></div></div>

<p>Indexes are also automatically used for equality comparisons of a indexed property in the WHERE clause.If you for some reason want to hint to specific indexes, see <a class="xref" href="query-using.html" title="9.8. Using">Section 9.8, “Using”</a>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (person:Person)
WHERE person.name = 'Andres'
RETURN person</pre><p>
</p>
<div class="queryresult table" id="d5e13165"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>person</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"Andres"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Person`(`name`)
create (_0:`Person` {`name`:"Andres"})
create (_1:`Person` {`name`:"Mark"})
create _0-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (person:Person) WHERE person.name = 'Andres' return person</strong></span></p>
</section>
<section class="section" id="schema-index-use-index-with-in"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Use index with IN</h3></div></div></div>

<p>The IN predicate on <code class="literal">person.name</code> in the following query will use the <code class="literal">Person(name)</code> index, if it exists. If you for some reason want Cypher to use specific indexes, you can enforce it using hints. See <a class="xref" href="query-using.html" title="9.8. Using">Section 9.8, “Using”</a>.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (person:Person)
WHERE person.name IN ['Andres', 'Mark']
RETURN person</pre><p>
</p>
<div class="queryresult table" id="d5e13195"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>person</th></tr></thead><tfoot><tr><th>2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"Andres"}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"Mark"}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create index on :`Person`(`name`)
create (_0:`Person` {`name`:"Andres"})
create (_1:`Person` {`name`:"Mark"})
create _0-[:`KNOWS`]-&gt;_1
</span><span class="command"><strong>
 match (person:Person) WHERE person.name IN ['Andres','Mark'] return person</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>