<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>3.4. Getting the Results You Want -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypherdoc-patterns-in-practice.html" title="3.3. Patterns in Practice" /><link rel="next" href="cypherdoc-how-to-compose-large-statements.html" title="3.5. How to Compose Large Statements" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="3.4. Getting the Results You Want" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-73202";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>3.4. Getting the Results You Want</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypherdoc-patterns-in-practice.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="cypher-getting-started.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypherdoc-how-to-compose-large-statements.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-getting-the-results-you-want"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">3.4. Getting the Results You Want</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="cypherdoc-getting-the-results-you-want.html#_filtering_results">Filtering Results</a></span></li><li><span class="section"><a href="cypherdoc-getting-the-results-you-want.html#_returning_results">Returning Results</a></span></li><li><span class="section"><a href="cypherdoc-getting-the-results-you-want.html#_aggregating_information">Aggregating Information</a></span></li><li><span class="section"><a href="cypherdoc-getting-the-results-you-want.html#_ordering_and_pagination">Ordering and Pagination</a></span></li><li><span class="section"><a href="cypherdoc-getting-the-results-you-want.html#_collecting_aggregation">Collecting Aggregation</a></span></li></ul></div>

<p>Let’s first get some data in to retrieve results from:</p>
<pre class="programlisting" data-lang="cypher">CREATE (matrix:Movie { title:"The Matrix",released:1997 })
CREATE (cloudAtlas:Movie { title:"Cloud Atlas",released:2012 })
CREATE (forrestGump:Movie { title:"Forrest Gump",released:1994 })
CREATE (keanu:Person { name:"Keanu Reeves", born:1964 })
CREATE (robert:Person { name:"Robert Zemeckis", born:1951 })
CREATE (tom:Person { name:"Tom Hanks", born:1956 })
CREATE (tom)-[:ACTED_IN { roles: ["Forrest"]}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN { roles: ['Zachry']}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)</pre>
<p>This is the data we will start out with:</p>
<div class="informalfigure">
<a class="ulink" href="images/cypherdoc--ee5ee0f8.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypherdoc--ee5ee0f8.svg" alt="cypherdoc--ee5ee0f8.svg" /></span>
</a>
</div>
<section class="section" id="_filtering_results"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Filtering Results</h3></div></div></div>

<p>So far we’ve matched patterns in the graph and always returned all results we found.
Quite often there are conditions in play for what we want to see.
Similar to in <span class="emphasis"><em>SQL</em></span> those filter conditions are expressed in a <code class="literal">WHERE</code> clause.
This clause allows to use any number of boolean expressions (predicates) combined with <code class="literal">AND</code>, <code class="literal">OR</code>, <code class="literal">XOR</code> and <code class="literal">NOT</code>.
The simplest predicates are comparisons, especially equality.</p>
<pre class="programlisting" data-lang="cypher">MATCH (m:Movie)
WHERE m.title = "The Matrix"
RETURN m</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>m</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{title:"The Matrix",released:1997}</code></p></td></tr></tbody></table></div>
<p>For equality on one or more properties, a more compact syntax can be used as well:</p>
<pre class="programlisting" data-lang="cypher">MATCH (m:Movie { title: "The Matrix" })
RETURN m</pre>
<p>Other options are numeric comparisons, matching regular expressions and checking the existence of values within a collection.</p>
<p>The <code class="literal">WHERE</code> clause below includes a regular expression match, a greater than comparison and a test to see if a value exists in a collection.</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ "K.+" OR m.released &gt; 2000 OR "Neo" IN r.roles
RETURN p,r,m</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th><th>r</th><th>m</th></tr></thead><tfoot><tr><th colspan="3">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">:ACTED_IN[1]{roles:["Zachry"]}</code></p></td><td><p><code class="literal">Node[1]{title:"Cloud Atlas",released:2012}</code></p></td></tr></tbody></table></div>
<p>One aspect that might be a little surprising is that you can even use patterns as predicates.
Where <code class="literal">MATCH</code> expands the number and shape of patterns matched, a pattern predicate restricts the current result set.
It only allows the paths to pass that satisfy the additional patterns as well (or <code class="literal">NOT</code>).</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p,m</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th><th>m</th></tr></thead><tfoot><tr><th colspan="2">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">Node[1]{title:"Cloud Atlas",released:2012}</code></p></td></tr><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">Node[2]{title:"Forrest Gump",released:1994}</code></p></td></tr></tbody></table></div>
<p>Here we find actors, because they sport an <code class="literal">ACTED_IN</code> relationship but then skip those that ever <code class="literal">DIRECTED</code> any movie.</p>
<p>There are also more advanced ways of filtering like collection-predicates which we will look at later on.</p>
</section>
<section class="section" id="_returning_results"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Returning Results</h3></div></div></div>

<p>So far we’ve returned only nodes, relationships, or paths directly via their identifiers.
But the <code class="literal">RETURN</code> clause can actually return any number of expressions.
But what are actually expressions in Cypher?</p>
<p>The simplest expressions are literal values like numbers, strings and arrays as <code class="literal">[1,2,3]</code>, and maps like <code class="literal">{name:"Tom Hanks", born:1964, movies:["Forrest Gump", ...], count:13}</code>.
You can access individual properties of any node, relationship, or map with a dot-syntax like <code class="literal">n.name</code>.
Individual elements or slices of arrays can be retrieved with subscripts like <code class="literal">names[0]</code> or <code class="literal">movies[1..-1]</code>.
Each function evaluation like <code class="literal">length(array)</code>, <code class="literal">toInt("12")</code>, <code class="literal">substring("2014-07-01",0,4)</code>, or <code class="literal">coalesce(p.nickname,"n/a")</code> is also an expression.</p>
<p>Predicates that you’d use in <code class="literal">WHERE</code> count as boolean expressions.</p>
<p>Of course simpler expressions can be composed and concatenated to form more complex expressions.</p>
<p>By default the expression itself will be used as label for the column, in many cases you want to alias that with a more understandable name using <code class="literal">expression AS alias</code>.
You can later on refer to that column using its alias.</p>
<pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p, p.name AS name, upper(p.name), coalesce(p.nickname,"n/a") AS nickname, { name: p.name,
  label:head(labels(p))} AS person</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>p</th><th>name</th><th>upper(p.name)</th><th>nickname</th><th>person</th></tr></thead><tfoot><tr><th colspan="5">3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[3]{name:"Keanu Reeves",born:1964}</code></p></td><td><p><code class="literal">"Keanu Reeves"</code></p></td><td><p><code class="literal">"KEANU REEVES"</code></p></td><td><p><code class="literal">"n/a"</code></p></td><td><p><code class="literal">{name -&gt; "Keanu Reeves", label -&gt; "Person"}</code></p></td></tr><tr><td><p><code class="literal">Node[4]{name:"Robert Zemeckis",born:1951}</code></p></td><td><p><code class="literal">"Robert Zemeckis"</code></p></td><td><p><code class="literal">"ROBERT ZEMECKIS"</code></p></td><td><p><code class="literal">"n/a"</code></p></td><td><p><code class="literal">{name -&gt; "Robert Zemeckis", label -&gt; "Person"}</code></p></td></tr><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">"Tom Hanks"</code></p></td><td><p><code class="literal">"TOM HANKS"</code></p></td><td><p><code class="literal">"n/a"</code></p></td><td><p><code class="literal">{name -&gt; "Tom Hanks", label -&gt; "Person"}</code></p></td></tr></tbody></table></div>
<p>If you’re interested in unique results you can use the <code class="literal">DISTINCT</code> keyword after <code class="literal">RETURN</code> to indicate that.</p>
</section>
<section class="section" id="_aggregating_information"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Aggregating Information</h3></div></div></div>

<p>In many cases you want to aggregate or group the data that you encounter while traversing patterns in your graph.
In Cypher aggregation happens in the <code class="literal">RETURN</code> clause while computing your final results.
Many common aggregation functions are supported, e.g. <code class="literal">count</code>, <code class="literal">sum</code>, <code class="literal">avg</code>, <code class="literal">min</code>, and <code class="literal">max</code>, but there are several more.</p>
<p>Counting the number of people in your database could be achieved by this:</p>
<pre class="programlisting" data-lang="cypher">MATCH (:Person)
RETURN count(*) AS people</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>people</th></tr></thead><tfoot><tr><th>1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">3</code></p></td></tr></tbody></table></div>
<p>Please note that <code class="literal">NULL</code> values are skipped during aggregation.
For aggregating only unique values use <code class="literal">DISTINCT</code>, like in <code class="literal">count(DISTINCT role)</code>.</p>
<p>Aggregation in Cypher just works.
You specify which result columns you want to aggregate and <span class="emphasis"><em>Cypher will use all non-aggregated columns as grouping keys</em></span>.</p>
<p>Aggregation affects which data is still visible in ordering or later query parts.</p>
<p>To find out how often an actor and director worked together, you’d run this statement:</p>
<pre class="programlisting" data-lang="cypher">MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor,director,count(*) AS collaborations</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>actor</th><th>director</th><th>collaborations</th></tr></thead><tfoot><tr><th colspan="3">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">Node[4]{name:"Robert Zemeckis",born:1951}</code></p></td><td><p><code class="literal">1</code></p></td></tr></tbody></table></div>
<p>Frequently you want to sort and paginate after aggregating a <code class="literal">count(x)</code>.</p>
</section>
<section class="section" id="_ordering_and_pagination"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Ordering and Pagination</h3></div></div></div>

<p>Ordering works like in other query languages, with an <code class="literal">ORDER BY expression [ASC|DESC]</code> clause.
The expression can be any expression discussed before as long as it is computable from the returned information.</p>
<p>So for instance if you return <code class="literal">person.name</code> you can still <code class="literal">ORDER BY person.age</code> as both are accessible from the <code class="literal">person</code> reference.
You cannot order by things that you can’t infer from the information you return.
This is especially important with aggregation and <code class="literal">DISTINCT</code> return values as both remove the visibility of data that is aggregated.</p>
<p>Pagination is a straightforward use of <code class="literal">SKIP {offset} LIMIT {count}</code>.</p>
<p>A common pattern is to aggregate for a count (score or frequency), order by it and only return the top-n entries.</p>
<p>For instance to find the most prolific actors you could do:</p>
<pre class="programlisting" data-lang="cypher">MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a,count(*) AS appearances
ORDER BY appearances DESC LIMIT 10;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>a</th><th>appearances</th></tr></thead><tfoot><tr><th colspan="2">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[5]{name:"Tom Hanks",born:1956}</code></p></td><td><p><code class="literal">2</code></p></td></tr></tbody></table></div>
</section>
<section class="section" id="_collecting_aggregation"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Collecting Aggregation</h3></div></div></div>

<p>The most helpful aggregation function is <code class="literal">collect</code>, which, as the name says, collects all aggregated values into a <span class="emphasis"><em>real</em></span> array or list.
This comes very handy in many situations as you don’t loose the detail information while aggregating.</p>
<p>Collect is well suited for retrieving the typical parent-child structures, where one core entity (parent, root or head) is returned per row with all it’s dependent information in associated collections created with <code class="literal">collect</code>.
This means there’s no need to repeat the parent information per each child-row or even running 1+n statements to retrieve the parent and its children individually.</p>
<p>To retrieve the cast of each movie in our database you could use this statement:</p>
<pre class="programlisting" data-lang="cypher">MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie</th><th>cast</th><th>actors</th></tr></thead><tfoot><tr><th colspan="3">2 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"Forrest Gump"</code></p></td><td><p><code class="literal">["Tom Hanks"]</code></p></td><td><p><code class="literal">1</code></p></td></tr><tr><td><p><code class="literal">"Cloud Atlas"</code></p></td><td><p><code class="literal">["Tom Hanks"]</code></p></td><td><p><code class="literal">1</code></p></td></tr></tbody></table></div>
<p>The lists created by collect can either be used from the client consuming the Cypher results or directly within a statement with any of the collection functions or predicates.</p>
<p class="cypherdoc-console"></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>