<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>16.4. Row operators -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="execution-plans-combining.html" title="16.3. Combining operators" /><link rel="next" href="execution-plans-update.html" title="16.5. Update Operators" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="16.4. Row operators" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-73202";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>16.4. Row operators</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="execution-plans-combining.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="execution-plans.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="execution-plans-update.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="execution-plans-row-operators"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">16.4. Row operators</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-eager">Eager</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-distinct">Distinct</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-eager-aggregation">Eager Aggregation</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-filter">Filter</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-limit">Limit</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-projection">Projection</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-skip">Skip</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-sort">Sort</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-top">Top</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-union">Union</a></span></li><li><span class="section"><a href="execution-plans-row-operators.html#query-plan-unwind">Unwind</a></span></li></ul></div>

<p>These operators take rows produced by another operator and transform them to a different set of rows</p>
<section class="section" id="query-plan-eager"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Eager</h3></div></div></div>

<p>For isolation purposes this operator makes sure that operations that affect subsequent operations are executed fully for the whole dataset before continuing execution.
 Otherwise it could trigger endless loops, matching data again, that was just created.
 The Eager operator can cause high memory usage when importing data or migrating graph structures.
 In such cases split up your operations into simpler steps e.g. you can import nodes and relationships separately.
 Alternatively return the records to be updated and run an update statement afterwards.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
MERGE (:Person:Clone { name:p.name })</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------+------+---------+-------------+----------------------------------+
| Operator     | Rows | DB Hits | Identifiers | Other                            |
+--------------+------+---------+-------------+----------------------------------+
| +EmptyResult |    0 |       0 |             |                                  |
| |            +------+---------+-------------+----------------------------------+
| +UpdateGraph |   14 |     195 | anon[23], p | MergeNode; p.name; :Person(name) |
| |            +------+---------+-------------+----------------------------------+
| +Eager       |   14 |       0 | p           |                                  |
| |            +------+---------+-------------+----------------------------------+
| +NodeByLabel |   14 |      15 | p           | :Person                          |
+--------------+------+---------+-------------+----------------------------------+

Total database accesses: 210</pre><p>
</p>
</section>
<section class="section" id="query-plan-distinct"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Distinct</h3></div></div></div>

<p>Removes duplicate rows from the incoming stream of rows.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (l:Location)&lt;-[:WORKS_IN]-(p:Person)
RETURN DISTINCT l</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+----------------+----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers    | Other                |
+------------------+----------------+------+---------+----------------+----------------------+
| +ProduceResults  |             14 |    6 |       0 | l              | l                    |
| |                +----------------+------+---------+----------------+----------------------+
| +Distinct        |             14 |    6 |       0 | l              | l                    |
| |                +----------------+------+---------+----------------+----------------------+
| +Filter          |             15 |   15 |      15 | anon[19], l, p | p:Person             |
| |                +----------------+------+---------+----------------+----------------------+
| +Expand(All)     |             15 |   15 |      25 | anon[19], l, p | (l)&lt;-[:WORKS_IN]-(p) |
| |                +----------------+------+---------+----------------+----------------------+
| +NodeByLabelScan |             10 |   10 |      11 | l              | :Location            |
+------------------+----------------+------+---------+----------------+----------------------+

Total database accesses: 51</pre><p>
</p>
</section>
<section class="section" id="query-plan-eager-aggregation"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Eager Aggregation</h3></div></div></div>

<p>Eagerly loads underlying results and stores it in a hash-map, using the grouping keys as the keys for the map.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (l:Location)&lt;-[:WORKS_IN]-(p:Person)
RETURN l.name AS location, COLLECT(p.name) AS people</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-------------------+----------------+------+---------+--------------------------+----------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Identifiers              | Other                |
+-------------------+----------------+------+---------+--------------------------+----------------------+
| +ProduceResults   |              4 |    6 |       0 | location, people         | location, people     |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +EagerAggregation |              4 |    6 |      15 | location, people         | location             |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Projection       |             15 |   15 |      15 | anon[19], l, location, p | l.name; p            |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Filter           |             15 |   15 |      15 | anon[19], l, p           | p:Person             |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +Expand(All)      |             15 |   15 |      25 | anon[19], l, p           | (l)&lt;-[:WORKS_IN]-(p) |
| |                 +----------------+------+---------+--------------------------+----------------------+
| +NodeByLabelScan  |             10 |   10 |      11 | l                        | :Location            |
+-------------------+----------------+------+---------+--------------------------+----------------------+

Total database accesses: 81</pre><p>
</p>
</section>
<section class="section" id="query-plan-filter"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Filter</h3></div></div></div>

<p>Filters each row coming from the child operator, only passing through rows that evaluate the predicates to <code class="literal">TRUE</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
WHERE p.name =~ "^a.*"
RETURN p</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+-----------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other                       |
+------------------+----------------+------+---------+-------------+-----------------------------+
| +ProduceResults  |             14 |    0 |       0 | p           | p                           |
| |                +----------------+------+---------+-------------+-----------------------------+
| +Filter          |             14 |    0 |      14 | p           | p.name ~= /{  AUTOSTRING0}/ |
| |                +----------------+------+---------+-------------+-----------------------------+
| +NodeByLabelScan |             14 |   14 |      15 | p           | :Person                     |
+------------------+----------------+------+---------+-------------+-----------------------------+

Total database accesses: 29</pre><p>
</p>
</section>
<section class="section" id="query-plan-limit"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Limit</h3></div></div></div>

<p>Returns the first <span class="emphasis"><em>n</em></span> rows from the incoming input.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
LIMIT 3</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other      |
+------------------+----------------+------+---------+-------------+------------+
| +ProduceResults  |              3 |    3 |       0 | p           | p          |
| |                +----------------+------+---------+-------------+------------+
| +Limit           |              3 |    3 |       0 | p           | Literal(3) |
| |                +----------------+------+---------+-------------+------------+
| +NodeByLabelScan |             14 |    3 |       4 | p           | :Person    |
+------------------+----------------+------+---------+-------------+------------+

Total database accesses: 4</pre><p>
</p>
</section>
<section class="section" id="query-plan-projection"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Projection</h3></div></div></div>

<p>For each row from its input, projection evaluates a set of expressions and produces a row with the results of the expressions.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">RETURN "hello" AS greeting</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other           |
+-----------------+----------------+------+---------+-------------+-----------------+
| +ProduceResults |              1 |    1 |       0 | greeting    | greeting        |
| |               +----------------+------+---------+-------------+-----------------+
| +Projection     |              1 |    1 |       0 | greeting    | {  AUTOSTRING0} |
+-----------------+----------------+------+---------+-------------+-----------------+

Total database accesses: 0</pre><p>
</p>
</section>
<section class="section" id="query-plan-skip"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Skip</h3></div></div></div>

<p>Skips <span class="emphasis"><em>n</em></span> rows from the incoming rows</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.id
SKIP 1</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-----------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                 |
+------------------+----------------+------+---------+--------------------------+-----------------------+
| +ProduceResults  |             14 |   13 |       0 | p                        | p                     |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |             14 |   13 |       0 | anon[35], anon[59], p, p | anon[35]              |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Skip            |             14 |   13 |       0 | anon[35], anon[59], p    | {  AUTOINT0}          |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Sort            |             14 |   14 |       0 | anon[35], anon[59], p    | anon[59]              |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |             14 |   14 |      28 | anon[35], anon[59], p    | anon[35]; anon[35].id |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +Projection      |             14 |   14 |       0 | anon[35], p              | p                     |
| |                +----------------+------+---------+--------------------------+-----------------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                        | :Person               |
+------------------+----------------+------+---------+--------------------------+-----------------------+

Total database accesses: 43</pre><p>
</p>
</section>
<section class="section" id="query-plan-sort"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Sort</h3></div></div></div>

<p>Sorts rows by a provided key.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.name</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                   |
+------------------+----------------+------+---------+--------------------------+-------------------------+
| +ProduceResults  |             14 |   14 |       0 | p                        | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |             14 |   14 |       0 | anon[24], anon[37], p, p | anon[24]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Sort            |             14 |   14 |       0 | anon[24], anon[37], p    | anon[37]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |             14 |   14 |      14 | anon[24], anon[37], p    | anon[24]; anon[24].name |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |             14 |   14 |       0 | anon[24], p              | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                        | :Person                 |
+------------------+----------------+------+---------+--------------------------+-------------------------+

Total database accesses: 29</pre><p>
</p>
</section>
<section class="section" id="query-plan-top"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Top</h3></div></div></div>

<p>Returns the first <span class="emphasis"><em>n</em></span> rows sorted by a provided key. The physical operator is called <code class="literal">Top</code>. Instead of sorting the whole input, only the top X rows are kept.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)
RETURN p
ORDER BY p.name
LIMIT 2</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+--------------------------+-------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers              | Other                   |
+------------------+----------------+------+---------+--------------------------+-------------------------+
| +ProduceResults  |              2 |    2 |       0 | p                        | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |              2 |    2 |       0 | anon[24], anon[37], p, p | anon[24]                |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Top             |              2 |    2 |       0 | anon[24], anon[37], p    | Literal(2);             |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |             14 |   14 |      14 | anon[24], anon[37], p    | anon[24]; anon[24].name |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +Projection      |             14 |   14 |       0 | anon[24], p              | p                       |
| |                +----------------+------+---------+--------------------------+-------------------------+
| +NodeByLabelScan |             14 |   14 |      15 | p                        | :Person                 |
+------------------+----------------+------+---------+--------------------------+-------------------------+

Total database accesses: 29</pre><p>
</p>
</section>
<section class="section" id="query-plan-union"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Union</h3></div></div></div>

<p>Union concatenates the results from the right plan after the results of the left plan.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Location)
RETURN p.name
UNION ALL MATCH (p:Country)
RETURN p.name</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+-------------+-----------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers | Other     |
+--------------------+----------------+------+---------+-------------+-----------+
| +ProduceResults    |             10 |   11 |       0 | p.name      | p.name    |
| |                  +----------------+------+---------+-------------+-----------+
| +Union             |             10 |   11 |       0 | p.name      |           |
| |\                 +----------------+------+---------+-------------+-----------+
| | +Projection      |              1 |    1 |       1 | p, p.name   | p.name    |
| | |                +----------------+------+---------+-------------+-----------+
| | +NodeByLabelScan |              1 |    1 |       2 | p           | :Country  |
| |                  +----------------+------+---------+-------------+-----------+
| +Projection        |             10 |   10 |      10 | p, p.name   | p.name    |
| |                  +----------------+------+---------+-------------+-----------+
| +NodeByLabelScan   |             10 |   10 |      11 | p           | :Location |
+--------------------+----------------+------+---------+-------------+-----------+

Total database accesses: 24</pre><p>
</p>
</section>
<section class="section" id="query-plan-unwind"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Unwind</h3></div></div></div>

<p>Takes a collection of values and returns one row per item in the collection.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">UNWIND range(1,5) AS value
RETURN value;</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other |
+-----------------+----------------+------+---------+-------------+-------+
| +ProduceResults |             10 |    5 |       0 | value       | value |
| |               +----------------+------+---------+-------------+-------+
| +UNWIND         |             10 |    5 |       0 | value       |       |
| |               +----------------+------+---------+-------------+-------+
| +Argument       |              1 |    1 |       0 |             |       |
+-----------------+----------------+------+---------+-------------+-------+

Total database accesses: 0</pre><p>
</p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>