<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>16.3. Combining operators -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="execution-plan-expand.html" title="16.2. Expand operators" /><link rel="next" href="execution-plans-row-operators.html" title="16.4. Row operators" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="16.3. Combining operators" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-74899";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>16.3. Combining operators</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="execution-plan-expand.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="execution-plans.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="execution-plans-row-operators.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="execution-plans-combining"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">16.3. Combining operators</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="execution-plans-combining.html#query-plan-node-hash-join">Node Hash Join</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-apply">Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-anti-semi-apply">Anti Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-let-anti-semi-apply">Let Anti Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-let-semi-apply">Let Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-select-or-anti-semi-apply">Select Or Anti Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-select-or-semi-apply">Select Or Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-semi-apply">Semi Apply</a></span></li><li><span class="section"><a href="execution-plans-combining.html#query-plan-triadic">Triadic</a></span></li></ul></div>

<section class="section" id="query-plan-node-hash-join"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Node Hash Join</h3></div></div></div>

<p>Using a hash table, a node hash join joins the inputs coming from the left with the inputs coming from the right. The join key is specified in the arguments of the operator.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (andreas:Person { name:'Andreas' })-[:WORKS_IN]-&gt;(location)&lt;-[:WORKS_IN]-(mattias:Person {
  name:'Mattis' })
RETURN location</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+------------------------------------------------+-----------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers                                    | Other                             |
+------------------+----------------+------+---------+------------------------------------------------+-----------------------------------+
| +ProduceResults  |         578865 |    0 |       0 | location                                       | location                          |
| |                +----------------+------+---------+------------------------------------------------+-----------------------------------+
| +Filter          |         578865 |    0 |       0 | anon[40], anon[64], andreas, location, mattias | NOT(anon[40] == anon[64])         |
| |                +----------------+------+---------+------------------------------------------------+-----------------------------------+
| +NodeHashJoin    |         578865 |    0 |       0 | anon[40], anon[64], andreas, location, mattias | location                          |
| |\               +----------------+------+---------+------------------------------------------------+-----------------------------------+
| | +Expand(All)   |           4501 |    0 |       0 | anon[64], location, mattias                    | (mattias)-[:WORKS_IN]-&gt;(location) |
| | |              +----------------+------+---------+------------------------------------------------+-----------------------------------+
| | +NodeIndexSeek |              1 |    0 |       1 | mattias                                        | :Person(name)                     |
| |                +----------------+------+---------+------------------------------------------------+-----------------------------------+
| +Expand(All)     |           4501 |    0 |       1 | anon[40], andreas, location                    | (andreas)-[:WORKS_IN]-&gt;(location) |
| |                +----------------+------+---------+------------------------------------------------+-----------------------------------+
| +NodeIndexSeek   |              1 |    1 |       2 | andreas                                        | :Person(name)                     |
+------------------+----------------+------+---------+------------------------------------------------+-----------------------------------+

Total database accesses: 4</pre><p>
</p>
</section>
<section class="section" id="query-plan-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Apply</h3></div></div></div>

<p>Apply works by performing a nested loop.
Every row being produced on the left hand side of the Apply operator will be fed to the Argument operator on the right hand side, and then Apply will yield the results coming from the RHS.
Apply, being a nested loop, can be seen as a warning that a better plan was not found.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (p:Person)-[:FRIENDS_WITH]-&gt;(f)
WITH p, count(f) AS fs
WHERE fs &gt; 0
OPTIONAL MATCH (p)-[:WORKS_IN*1..2]-&gt;(city)
RETURN p, city</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+---------------------------+----------------+------+---------+----------------------------------+--------------------------+
| Operator                  | Estimated Rows | Rows | DB Hits | Identifiers                      | Other                    |
+---------------------------+----------------+------+---------+----------------------------------+--------------------------+
| +ProduceResults           |              1 |    2 |       0 | city, p                          | p, city                  |
| |                         +----------------+------+---------+----------------------------------+--------------------------+
| +Apply                    |              1 |    2 |       0 | anon[92], anon[126], city, fs, p |                          |
| |\                        +----------------+------+---------+----------------------------------+--------------------------+
| | +Apply                  |              1 |    2 |       0 | anon[92], anon[126], city, fs, p |                          |
| | |\                      +----------------+------+---------+----------------------------------+--------------------------+
| | | +Optional             |              1 |    2 |       0 | anon[126], city, p               |                          |
| | | |                     +----------------+------+---------+----------------------------------+--------------------------+
| | | +VarLengthExpand(All) |              1 |    2 |       6 | anon[126], city, p               | (p)-[:WORKS_IN*]-&gt;(city) |
| | | |                     +----------------+------+---------+----------------------------------+--------------------------+
| | | +Argument             |              1 |    2 |       0 | p                                |                          |
| | |                       +----------------+------+---------+----------------------------------+--------------------------+
| | +Filter                 |              1 |    2 |       0 | anon[92], fs, p                  | anon[92]                 |
| | |                       +----------------+------+---------+----------------------------------+--------------------------+
| | +Argument               |              1 |    2 |       0 | anon[92], fs, p                  |                          |
| |                         +----------------+------+---------+----------------------------------+--------------------------+
| +Projection               |              1 |    2 |       0 | anon[92], fs, p                  | p; fs; fs &gt; {  AUTOINT0} |
| |                         +----------------+------+---------+----------------------------------+--------------------------+
| +EagerAggregation         |              1 |    2 |       0 | fs, p                            | p                        |
| |                         +----------------+------+---------+----------------------------------+--------------------------+
| +Expand(All)              |              2 |    2 |      16 | anon[17], f, p                   | (p)-[:FRIENDS_WITH]-&gt;(f) |
| |                         +----------------+------+---------+----------------------------------+--------------------------+
| +NodeByLabelScan          |             14 |   14 |      15 | p                                | :Person                  |
+---------------------------+----------------+------+---------+----------------------------------+--------------------------+

Total database accesses: 37</pre><p>
</p>
</section>
<section class="section" id="query-plan-anti-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Anti Semi Apply</h3></div></div></div>

<p>Tests for the absence of a pattern predicate.
A pattern predicate that is prepended by <code class="literal">NOT</code> is solved with <code class="literal">AntiSemiApply</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (me:Person { name: "me" }),(other:Person)
WHERE NOT (me)-[:FRIENDS_WITH]-&gt;(other)
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+---------------------+-------------------------------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers         | Other                         |
+--------------------+----------------+------+---------+---------------------+-------------------------------+
| +ProduceResults    |              3 |   13 |       0 | other               | other                         |
| |                  +----------------+------+---------+---------------------+-------------------------------+
| +AntiSemiApply     |              3 |   13 |       0 | me, other           |                               |
| |\                 +----------------+------+---------+---------------------+-------------------------------+
| | +Expand(Into)    |              0 |    0 |      49 | anon[73], me, other | (me)-[:FRIENDS_WITH]-&gt;(other) |
| | |                +----------------+------+---------+---------------------+-------------------------------+
| | +Argument        |             14 |   14 |       0 | me, other           |                               |
| |                  +----------------+------+---------+---------------------+-------------------------------+
| +CartesianProduct  |             14 |   14 |       0 | me, other           |                               |
| |\                 +----------------+------+---------+---------------------+-------------------------------+
| | +NodeByLabelScan |             14 |   14 |      15 | other               | :Person                       |
| |                  +----------------+------+---------+---------------------+-------------------------------+
| +NodeIndexSeek     |              1 |    1 |       2 | me                  | :Person(name)                 |
+--------------------+----------------+------+---------+---------------------+-------------------------------+

Total database accesses: 66</pre><p>
</p>
</section>
<section class="section" id="query-plan-let-anti-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Let Anti Semi Apply</h3></div></div></div>

<p>Tests for the absence of a pattern predicate.
When a query contains multiple pattern predicates <code class="literal">LetSemiApply</code> will be used to evaluate the first of these.
It will record the result of evaluating the predicate but will leave any filtering to another operator.
The following query will find all the people who don’t have anyfriend or who work somewhere. The <code class="literal">LetSemiApply</code> operator
will be used to check for the absence of the <code class="literal">FRIENDS_WITH</code> relationship from each person.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (other:Person)
WHERE NOT ((other)-[:FRIENDS_WITH]-&gt;()) OR (other)-[:WORKS_IN]-&gt;()
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers               | Other                       |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| +ProduceResults    |             11 |   14 |       0 | other                     | other                       |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +SelectOrSemiApply |             11 |   14 |       0 | anon[42], other           | anon[42]                    |
| |\                 +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)     |             15 |    0 |       2 | anon[82], anon[96], other | (other)-[:WORKS_IN]-&gt;()     |
| | |                +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument        |             14 |    2 |       0 | other                     |                             |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +LetAntiSemiApply  |             14 |   14 |       0 | anon[42], other           |                             |
| |\                 +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)     |              2 |    0 |      14 | anon[50], anon[68], other | (other)-[:FRIENDS_WITH]-&gt;() |
| | |                +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument        |             14 |   14 |       0 | other                     |                             |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +NodeByLabelScan   |             14 |   14 |      15 | other                     | :Person                     |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+

Total database accesses: 31</pre><p>
</p>
</section>
<section class="section" id="query-plan-let-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Let Semi Apply</h3></div></div></div>

<p>Tests for the existence of a pattern predicate.
When a query contains multiple pattern predicates <code class="literal">LetSemiApply</code> will be used to evaluate the first of these.
It will record the result of evaluating the predicate but will leave any filtering to a another operator.
The following query will find all the people who have a friend or who work somewhere. The <code class="literal">LetSemiApply</code> operator
will be used to check for the existence of the <code class="literal">FRIENDS_WITH</code> relationship from each person.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (other:Person)
WHERE (other)-[:FRIENDS_WITH]-&gt;() OR (other)-[:WORKS_IN]-&gt;()
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers               | Other                       |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| +ProduceResults    |             13 |   14 |       0 | other                     | other                       |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +SelectOrSemiApply |             13 |   14 |       0 | anon[38], other           | anon[38]                    |
| |\                 +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)     |             15 |    0 |      12 | anon[77], anon[91], other | (other)-[:WORKS_IN]-&gt;()     |
| | |                +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument        |             14 |   12 |       0 | other                     |                             |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +LetSemiApply      |             14 |   14 |       0 | anon[38], other           |                             |
| |\                 +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)     |              2 |    0 |      14 | anon[46], anon[64], other | (other)-[:FRIENDS_WITH]-&gt;() |
| | |                +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument        |             14 |   14 |       0 | other                     |                             |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +NodeByLabelScan   |             14 |   14 |      15 | other                     | :Person                     |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+

Total database accesses: 41</pre><p>
</p>
</section>
<section class="section" id="query-plan-select-or-anti-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Select Or Anti Semi Apply</h3></div></div></div>

<p>Tests for the absence of a pattern predicate and evaluates a predicate.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (other:Person)
WHERE other.age &gt; 25 OR NOT (other)-[:FRIENDS_WITH]-&gt;()
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------------+----------------+------+---------+---------------------------+-----------------------------+
| Operator               | Estimated Rows | Rows | DB Hits | Identifiers               | Other                       |
+------------------------+----------------+------+---------+---------------------------+-----------------------------+
| +ProduceResults        |              4 |   12 |       0 | other                     | other                       |
| |                      +----------------+------+---------+---------------------------+-----------------------------+
| +SelectOrAntiSemiApply |              4 |   12 |      28 | other                     | other.age &gt; {  AUTOINT0}    |
| |\                     +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)         |              2 |    0 |      14 | anon[68], anon[86], other | (other)-[:FRIENDS_WITH]-&gt;() |
| | |                    +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument            |             14 |   14 |       0 | other                     |                             |
| |                      +----------------+------+---------+---------------------------+-----------------------------+
| +NodeByLabelScan       |             14 |   14 |      15 | other                     | :Person                     |
+------------------------+----------------+------+---------+---------------------------+-----------------------------+

Total database accesses: 57</pre><p>
</p>
</section>
<section class="section" id="query-plan-select-or-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Select Or Semi Apply</h3></div></div></div>

<p>Tests for the existence of a pattern predicate and evaluates a predicate.
This operator allows for the mixing of normal predicates and pattern predicates that check for the existing of a pattern.
First the normal expression predicate is evaluated, and only if it returns <code class="literal">FALSE</code> the costly pattern predicate evaluation is performed.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (other:Person)
WHERE other.age &gt; 25 OR (other)-[:FRIENDS_WITH]-&gt;()
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| Operator           | Estimated Rows | Rows | DB Hits | Identifiers               | Other                       |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+
| +ProduceResults    |             11 |    2 |       0 | other                     | other                       |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +SelectOrSemiApply |             11 |    2 |      28 | other                     | other.age &gt; {  AUTOINT0}    |
| |\                 +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)     |              2 |    0 |      14 | anon[64], anon[82], other | (other)-[:FRIENDS_WITH]-&gt;() |
| | |                +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument        |             14 |   14 |       0 | other                     |                             |
| |                  +----------------+------+---------+---------------------------+-----------------------------+
| +NodeByLabelScan   |             14 |   14 |      15 | other                     | :Person                     |
+--------------------+----------------+------+---------+---------------------------+-----------------------------+

Total database accesses: 57</pre><p>
</p>
</section>
<section class="section" id="query-plan-semi-apply"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Semi Apply</h3></div></div></div>

<p>Tests for the existence of a pattern predicate.
<code class="literal">SemiApply</code> takes a row from it’s child operator and feeds it to the <code class="literal">Argument</code> operator on the right hand side of <code class="literal">SemiApply</code>.
If the right hand side operator tree yields at least one row, the row from the left hand side is yielded by the <code class="literal">SemiApply</code> operator.
This makes <code class="literal">SemiApply</code> a filtering operator, used mostly for pattern predicates in queries.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (other:Person)
WHERE (other)-[:FRIENDS_WITH]-&gt;()
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+---------------------------+-----------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers               | Other                       |
+------------------+----------------+------+---------+---------------------------+-----------------------------+
| +ProduceResults  |             11 |    2 |       0 | other                     | other                       |
| |                +----------------+------+---------+---------------------------+-----------------------------+
| +SemiApply       |             11 |    2 |       0 | other                     |                             |
| |\               +----------------+------+---------+---------------------------+-----------------------------+
| | +Expand(All)   |              2 |    0 |      14 | anon[46], anon[64], other | (other)-[:FRIENDS_WITH]-&gt;() |
| | |              +----------------+------+---------+---------------------------+-----------------------------+
| | +Argument      |             14 |   14 |       0 | other                     |                             |
| |                +----------------+------+---------+---------------------------+-----------------------------+
| +NodeByLabelScan |             14 |   14 |      15 | other                     | :Person                     |
+------------------+----------------+------+---------+---------------------------+-----------------------------+

Total database accesses: 29</pre><p>
</p>
</section>
<section class="section" id="query-plan-triadic"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Triadic</h3></div></div></div>

<p>Triadic is used to solve triangular queries, such as the very common "find my friend-of-friends that are not already my friend".
It does so by putting all the "friends" in a set, and use that set to check if the friend-of-friends are already connected to me.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (me:Person)-[:FRIENDS_WITH]-()-[:FRIENDS_WITH]-(other)
WHERE NOT (me)-[:FRIENDS_WITH]-(other)
RETURN other</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-------------------+----------------+------+---------+-----------------------------------------+----------------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Identifiers                             | Other                      |
+-------------------+----------------+------+---------+-----------------------------------------+----------------------------+
| +ProduceResults   |              0 |    2 |       0 | other                                   | other                      |
| |                 +----------------+------+---------+-----------------------------------------+----------------------------+
| +TriadicSelection |              0 |    2 |       0 | anon[18], anon[35], anon[37], me, other | me, anon[35], other        |
| |\                +----------------+------+---------+-----------------------------------------+----------------------------+
| | +Filter         |              0 |    2 |       0 | anon[18], anon[35], anon[37], me, other | NOT(anon[18] == anon[37])  |
| | |               +----------------+------+---------+-----------------------------------------+----------------------------+
| | +Expand(All)    |              0 |    6 |      10 | anon[18], anon[35], anon[37], me, other | ()-[:FRIENDS_WITH]-(other) |
| | |               +----------------+------+---------+-----------------------------------------+----------------------------+
| | +Argument       |              4 |    4 |       0 | anon[18], anon[35], me                  |                            |
| |                 +----------------+------+---------+-----------------------------------------+----------------------------+
| +Expand(All)      |              4 |    4 |      18 | anon[18], anon[35], me                  | (me)-[:FRIENDS_WITH]-()    |
| |                 +----------------+------+---------+-----------------------------------------+----------------------------+
| +NodeByLabelScan  |             14 |   14 |      15 | me                                      | :Person                    |
+-------------------+----------------+------+---------+-----------------------------------------+----------------------------+

Total database accesses: 43</pre><p>
</p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>