<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>16.1. Starting point operators -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="execution-plans.html" title="Chapter 16. Execution Plans" /><link rel="next" href="execution-plan-expand.html" title="16.2. Expand operators" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="16.1. Starting point operators" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-74899";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>16.1. Starting point operators</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="execution-plans.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="execution-plans.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="execution-plan-expand.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="execution-plans-starting-query"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">16.1. Starting point operators</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-all-nodes-scan">All Nodes Scan</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-directed-relationship-by-id-seek">Directed Relationship By Id Seek</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-node-by-id-seek">Node by Id seek</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-node-by-label-scan">Node by label scan</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-node-index-seek">Node index seek</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-node-index-scan">Node index scan</a></span></li><li><span class="section"><a href="execution-plans-starting-query.html#query-plan-undirected-relationship-by-id-seek">Undirected Relationship By Id Seek</a></span></li></ul></div>

<p>These operators find parts of the graph from which to start.</p>
<section class="section" id="query-plan-all-nodes-scan"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">All Nodes Scan</h3></div></div></div>

<p>Reads all nodes from the node store. The identifier that will contain the nodes is seen in the arguments.
If your query is using this operator, you are very likely to see performance problems on any non-trivial database.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other |
+-----------------+----------------+------+---------+-------------+-------+
| +ProduceResults |             35 |   35 |       0 | n           | n     |
| |               +----------------+------+---------+-------------+-------+
| +AllNodesScan   |             35 |   35 |      36 | n           |       |
+-----------------+----------------+------+---------+-------------+-------+

Total database accesses: 36</pre><p>
</p>
</section>
<section class="section" id="query-plan-directed-relationship-by-id-seek"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Directed Relationship By Id Seek</h3></div></div></div>

<p>Reads one or more relationships by id from the relationship store. Produces both the relationship and the nodes on either side.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n1)-[r]-&gt;()
WHERE id(r)= 0
RETURN r, n1</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+
| Operator                          | Estimated Rows | Rows | DB Hits | Identifiers     | Other                                      |
+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+
| +ProduceResults                   |              1 |    1 |       0 | n1, r           | r, n1                                      |
| |                                 +----------------+------+---------+-----------------+--------------------------------------------+
| +DirectedRelationshipByIdSeekPipe |              1 |    1 |       1 | anon[17], n1, r | EntityByIdRhs(SingleSeekArg({  AUTOINT0})) |
+-----------------------------------+----------------+------+---------+-----------------+--------------------------------------------+

Total database accesses: 1</pre><p>
</p>
</section>
<section class="section" id="query-plan-node-by-id-seek"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Node by Id seek</h3></div></div></div>

<p>Reads one or more nodes by id from the node store.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
WHERE id(n)= 0
RETURN n</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other |
+-----------------+----------------+------+---------+-------------+-------+
| +ProduceResults |              1 |    1 |       0 | n           | n     |
| |               +----------------+------+---------+-------------+-------+
| +NodeByIdSeek   |              1 |    1 |       1 | n           |       |
+-----------------+----------------+------+---------+-------------+-------+

Total database accesses: 1</pre><p>
</p>
</section>
<section class="section" id="query-plan-node-by-label-scan"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Node by label scan</h3></div></div></div>

<p>Using the label index, fetches all nodes with a specific label on them from the node label index.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (person:Person)
RETURN person</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+---------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other   |
+------------------+----------------+------+---------+-------------+---------+
| +ProduceResults  |             14 |   14 |       0 | person      | person  |
| |                +----------------+------+---------+-------------+---------+
| +NodeByLabelScan |             14 |   14 |      15 | person      | :Person |
+------------------+----------------+------+---------+-------------+---------+

Total database accesses: 15</pre><p>
</p>
</section>
<section class="section" id="query-plan-node-index-seek"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Node index seek</h3></div></div></div>

<p>Finds nodes using an index seek. The node identifier and the index used is shown in the arguments of the operator.
If the index is a unique index, the operator is called NodeUniqueIndexSeek instead.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (location:Location { name: "Malmo" })
RETURN location</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other           |
+-----------------+----------------+------+---------+-------------+-----------------+
| +ProduceResults |              1 |    1 |       0 | location    | location        |
| |               +----------------+------+---------+-------------+-----------------+
| +NodeIndexSeek  |              1 |    1 |       2 | location    | :Location(name) |
+-----------------+----------------+------+---------+-------------+-----------------+

Total database accesses: 2</pre><p>
</p>
</section>
<section class="section" id="query-plan-node-index-scan"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Node index scan</h3></div></div></div>

<p>An index scan goes through all values stored in an index, and can be used to find all nodes with a particular label having a specified property (e.g. <code class="literal">exists(n.prop)</code>).</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (l:Location)
WHERE HAS (l.name)
RETURN l</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other           |
+-----------------+----------------+------+---------+-------------+-----------------+
| +ProduceResults |             10 |   10 |       0 | l           | l               |
| |               +----------------+------+---------+-------------+-----------------+
| +NodeIndexScan  |             10 |   10 |      11 | l           | :Location(name) |
+-----------------+----------------+------+---------+-------------+-----------------+

Total database accesses: 11</pre><p>
</p>
</section>
<section class="section" id="query-plan-undirected-relationship-by-id-seek"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Undirected Relationship By Id Seek</h3></div></div></div>

<p>Reads one or more relationships by id from the relationship store.
For each relationship, two rows are produced with start and end nodes arranged differently.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n1)-[r]-()
WHERE id(r)= 1
RETURN r, n1</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+---------------------------------+----------------+------+---------+-----------------+-------+
| Operator                        | Estimated Rows | Rows | DB Hits | Identifiers     | Other |
+---------------------------------+----------------+------+---------+-----------------+-------+
| +ProduceResults                 |              1 |    2 |       0 | n1, r           | r, n1 |
| |                               +----------------+------+---------+-----------------+-------+
| +UndirectedRelationshipByIdSeek |              1 |    2 |       1 | anon[16], n1, r |       |
+---------------------------------+----------------+------+---------+-----------------+-------+

Total database accesses: 1</pre><p>
</p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>