<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>10.8. Using -  - The Neo4j Manual v2.3-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-union.html" title="10.7. Union" /><link rel="next" href="query-read.html" title="Chapter 11. Reading Clauses" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="10.8. Using" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-73202";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.4/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.4/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/2.1.1/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/5.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Section table of contents -->

<script type="text/javascript" src="js/toc.js"></script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.3-SNAPSHOT</span><span>10.8. Using</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-union.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-general.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-read.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-using"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">10.8. Using</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-using.html#using-query-using-an-index-hint">Query using an index hint</a></span></li><li><span class="section"><a href="query-using.html#using-query-using-multiple-index-hints">Query using multiple index hints</a></span></li><li><span class="section"><a href="query-using.html#using-hinting-a-label-scan">Hinting a label scan</a></span></li><li><span class="section"><a href="query-using.html#using-hinting-a-join-on-a-single-node">Hinting a join on a single node</a></span></li><li><span class="section"><a href="query-using.html#using-hinting-a-join-on-multiple-nodes">Hinting a join on multiple nodes</a></span></li></ul></div>

<div class="abstract">
<p><code class="literal">USING</code> is used to influence the decisions of the planner when building an execution plan for a query.
NOTE: Forcing planner behaviour is an advanced feature, and should be used with caution by experienced developers and/or database administrators only, as it may cause queries to perform poorly.</p>
</div>
<p>When executing a query, Neo4j needs to decide where in the query graph to start matching.
This is done by looking at the <code class="literal">MATCH</code> clause and the <code class="literal">WHERE</code> conditions and using that information to find useful indexes.</p>
<p>This index might not be the best choice though — sometimes multiple indexes could be used, and Neo4j has picked the wrong one (from a performance point of view).</p>
<p>You can force Neo4j to use a specific starting point through the <code class="literal">USING</code> clause.
This is called giving an index hint.</p>
<p>If your query matches large parts of an index, it might be faster to scan the label and filter out nodes that do not match.
To do this, you can use <code class="literal">USING SCAN</code>.
It will force Cypher to not use an index that could have been used, and instead do a label scan.</p>
<div class="admonitionblock Note"><table><tr><td class="icon"><img alt="[Note]" src="images/icons/admon/note.svg" /></td><td class="content"><b>Note</b><p>You cannot use index hints if your query has a <code class="literal">START</code> clause.</p></td></tr></table></div>
<p>You can also force Neo4j to produce plans which perform joins between query sub-graphs.</p>
<section class="section" id="using-query-using-an-index-hint"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Query using an index hint</h3></div></div></div>

<p>To query using an index hint, use <code class="literal">USING</code> <code class="literal">INDEX</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n:Swede)
USING INDEX n:Swede(surname)
WHERE n.surname = 'Taylor'
RETURN n</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------+-----------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers | Other           |
+-----------------+----------------+------+---------+-------------+-----------------+
| +ProduceResults |              1 |    1 |       0 | n           | n               |
| |               +----------------+------+---------+-------------+-----------------+
| +NodeIndexSeek  |              1 |    1 |       2 | n           | :Swede(surname) |
+-----------------+----------------+------+---------+-------------+-----------------+

Total database accesses: 2</pre><p>
</p>
</section>
<section class="section" id="using-query-using-multiple-index-hints"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Query using multiple index hints</h3></div></div></div>

<p>To query using multiple index hints, use <code class="literal">USING</code> <code class="literal">INDEX</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (m:German)--&gt;(n:Swede)
USING INDEX m:German(surname)
USING INDEX n:Swede(surname)
WHERE m.surname = 'Plantikow' AND n.surname = 'Taylor'
RETURN m</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-------------------+------+---------+----------------+----------------+
| Operator          | Rows | DB Hits | Identifiers    | Other          |
+-------------------+------+---------+----------------+----------------+
| +ColumnFilter     |    1 |       0 | m              | keep columns m |
| |                 +------+---------+----------------+----------------+
| +TraversalMatcher |    1 |      11 | anon[17], m, n | n, anon[17], m |
+-------------------+------+---------+----------------+----------------+

Total database accesses: 11</pre><p>
</p>
</section>
<section class="section" id="using-hinting-a-label-scan"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Hinting a label scan</h3></div></div></div>

<p>If the best performance is to be had by scanning all nodes in a label and then filtering on that set, use <code class="literal">USING</code> <code class="literal">SCAN</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (m:German)
USING SCAN m:German
WHERE m.surname = 'Plantikow'
RETURN m</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+------------------+----------------+------+---------+-------------+------------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Identifiers | Other                        |
+------------------+----------------+------+---------+-------------+------------------------------+
| +ProduceResults  |              1 |    1 |       0 | m           | m                            |
| |                +----------------+------+---------+-------------+------------------------------+
| +Filter          |              1 |    1 |       1 | m           | m.surname == {  AUTOSTRING0} |
| |                +----------------+------+---------+-------------+------------------------------+
| +NodeByLabelScan |              1 |    1 |       2 | m           | :German                      |
+------------------+----------------+------+---------+-------------+------------------------------+

Total database accesses: 3</pre><p>
</p>
</section>
<section class="section" id="using-hinting-a-join-on-a-single-node"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Hinting a join on a single node</h3></div></div></div>

<p>To force the query planner to produce plans with joins in them, use <code class="literal">USING</code> <code class="literal">JOIN</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (andres { name:'Andres' })--&gt;(x)&lt;--(emil { name: 'Emil' })
USING JOIN ON x
RETURN x</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers                         | Other                                                                     |
+-----------------+----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +ProduceResults |              0 |    1 |       0 | x                                   | x                                                                         |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       6 | anon[31], anon[37], andres, emil, x | Ands(Fby(NOT(anon[31] == anon[37]),Last(andres.name == {  AUTOSTRING0}))) |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +Expand(All)    |              2 |    9 |      12 | anon[31], anon[37], andres, emil, x | (x)&lt;--(andres)                                                            |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +NodeHashJoin   |              1 |    3 |       0 | anon[37], emil, x                   | x                                                                         |
| |\              +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| | +AllNodesScan |              5 |    5 |       6 | x                                   |                                                                           |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +Expand(All)    |              1 |    3 |       4 | anon[37], emil, x                   | (emil)--&gt;(x)                                                              |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +Filter         |              1 |    1 |       5 | emil                                | emil.name == {  AUTOSTRING1}                                              |
| |               +----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+
| +AllNodesScan   |              5 |    5 |       6 | emil                                |                                                                           |
+-----------------+----------------+------+---------+-------------------------------------+---------------------------------------------------------------------------+

Total database accesses: 39</pre><p>
</p>
</section>
<section class="section" id="using-hinting-a-join-on-multiple-nodes"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Hinting a join on multiple nodes</h3></div></div></div>

<p>To force the query planner to produce plans with joins in them, use <code class="literal">USING</code> <code class="literal">JOIN</code>.</p>
<p><strong>Query </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (andres { name:'Andres' })-[r1]-&gt;(x)&lt;-[r2]-(y)-[r3]-(andres)
USING JOIN ON x, y
RETURN x, y</pre><p>
</p>
<p><strong>Query Plan </strong>
</p><pre class="programlisting" data-lang="plain">+-----------------+----------------+------+---------+--------------------------+----------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Identifiers              | Other                                        |
+-----------------+----------------+------+---------+--------------------------+----------------------------------------------+
| +ProduceResults |              1 |    3 |       0 | x, y                     | x, y                                         |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +Filter         |              1 |    3 |       0 | andres, r1, r2, r3, x, y | Ands(Fby(NOT(r1 == r2),Last(NOT(r2 == r3)))) |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +NodeHashJoin   |              1 |    3 |       0 | andres, r1, r2, r3, x, y | x, y                                         |
| |\              +----------------+------+---------+--------------------------+----------------------------------------------+
| | +Expand(All)  |             10 |   10 |      15 | r2, x, y                 | (y)-[r2:]-&gt;(x)                               |
| | |             +----------------+------+---------+--------------------------+----------------------------------------------+
| | +AllNodesScan |              5 |    5 |       6 | y                        |                                              |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +Filter         |              3 |    3 |       0 | andres, r1, r3, x, y     | NOT(r1 == r3)                                |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +Expand(All)    |              3 |    4 |       5 | andres, r1, r3, x, y     | (andres)-[r3:]-(y)                           |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +Expand(All)    |              1 |    1 |       2 | andres, r1, x            | (andres)-[r1:]-&gt;(x)                          |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +Filter         |              1 |    1 |       5 | andres                   | andres.name == {  AUTOSTRING0}               |
| |               +----------------+------+---------+--------------------------+----------------------------------------------+
| +AllNodesScan   |              5 |    5 |       6 | andres                   |                                              |
+-----------------+----------------+------+---------+--------------------------+----------------------------------------------+

Total database accesses: 39</pre><p>
</p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>