<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>4.3. Social Movie Database -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="cypherdoc-movie-database.html" title="4.2. Movie Database" /><link rel="next" href="cypherdoc-finding-paths.html" title="4.4. Finding Paths" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="4.3. Social Movie Database" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-70838";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>4.3. Social Movie Database</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="cypherdoc-movie-database.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="tutorials-cypher.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="cypherdoc-finding-paths.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="cypherdoc-social-movie-database"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">4.3. Social Movie Database</h2></div></div></div>

<p>Our example graph consists of movies with title and year and actors with a name.
Actors have <code class="literal">ACTS_IN</code> relationships to movies, which represents the role they played.
This relationship also has a role attribute.</p>
<p>So far, we queried the movie data; now let’s <span class="emphasis"><em>update the graph</em></span> too.</p>
<pre class="programlisting" data-lang="cypher">CREATE (matrix1:Movie { title : 'The Matrix', year : '1999-03-31' })
CREATE (matrix2:Movie { title : 'The Matrix Reloaded', year : '2003-05-07' })
CREATE (matrix3:Movie { title : 'The Matrix Revolutions', year : '2003-10-27' })
CREATE (keanu:Actor { name:'Keanu Reeves' })
CREATE (laurence:Actor { name:'Laurence Fishburne' })
CREATE (carrieanne:Actor { name:'Carrie-Anne Moss' })
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix1)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix2)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix3)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix1)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix2)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix3)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix1)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix2)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix3)</pre>
<p class="cypherdoc-console"></p>
<p>We will add ourselves, friends and movie ratings.</p>
<p>Here’s how to add a node for yourself and return it, let’s say your name is “Me”:</p>
<pre class="programlisting" data-lang="cypher">CREATE (me:User { name: "Me" })
RETURN me;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>me</th></tr></thead><tfoot><tr><th>1 row
</th></tr><tr><th>Nodes created: 1
</th></tr><tr><th>Properties set: 1
</th></tr><tr><th>Labels added: 1</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[6]{name:"Me"}</code></p></td></tr></tbody></table></div>
<p>Let’s check if the node is there:</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" })
RETURN me.name;</pre>
<p>Add a movie rating:</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" }),(movie:Movie { title: "The Matrix" })
CREATE (me)-[:RATED { stars : 5, comment : "I love that movie!" }]-&gt;(movie);</pre>
<p>Which movies did I rate?</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" }),(me)-[rating:RATED]-&gt;(movie)
RETURN movie.title, rating.stars, rating.comment;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th><th>rating.stars</th><th>rating.comment</th></tr></thead><tfoot><tr><th colspan="3">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix"</code></p></td><td><p><code class="literal">5</code></p></td><td><p><code class="literal">"I love that movie!"</code></p></td></tr></tbody></table></div>
<p>We need a friend!</p>
<pre class="programlisting" data-lang="cypher">CREATE (friend:User { name: "A Friend" })
RETURN friend;</pre>
<p>Add our friendship idempotently, so we can re-run the query without adding it several times.
We return the relationship to check that it has not been created several times.</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" }),(friend:User { name: "A Friend" })
CREATE UNIQUE (me)-[friendship:FRIEND]-&gt;(friend)
RETURN friendship;</pre>
<p>You can rerun the query, see that it doesn’t change anything the second time!</p>
<p>Let’s update our friendship with a <code class="literal">since</code> property:</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" })-[friendship:FRIEND]-&gt;(friend:User { name: "A Friend" })
SET friendship.since='forever'
RETURN friendship;</pre>
<p>Let’s pretend us being our friend and wanting to see which movies our friends have rated.</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "A Friend" })-[:FRIEND]-(friend)-[rating:RATED]-&gt;(movie)
RETURN movie.title, avg(rating.stars) AS stars, collect(rating.comment) AS comments, count(*);</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>movie.title</th><th>stars</th><th>comments</th><th>count(*)</th></tr></thead><tfoot><tr><th colspan="4">1 row</th></tr></tfoot><tbody><tr><td><p><code class="literal">"The Matrix"</code></p></td><td><p><code class="literal">5.0</code></p></td><td><p><code class="literal">["I love that movie!"]</code></p></td><td><p><code class="literal">1</code></p></td></tr></tbody></table></div>
<p>That’s too little data, let’s add some more friends and friendships.</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" })
FOREACH (i IN range(1,10)| CREATE (friend:User { name: "Friend " + i }),(me)-[:FRIEND]-&gt;(friend));</pre>
<p>Show all our friends:</p>
<pre class="programlisting" data-lang="cypher">MATCH (me:User { name: "Me" })-[r:FRIEND]-&gt;(friend)
RETURN type(r) AS friendship, friend.name;</pre>
<div class="queryresult table"><table cellspacing="0" cellpadding="0"><thead><tr><th>friendship</th><th>friend.name</th></tr></thead><tfoot><tr><th colspan="2">11 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"A Friend"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 7"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 6"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 9"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 8"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 10"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 1"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 2"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 3"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 4"</code></p></td></tr><tr><td><p><code class="literal">"FRIEND"</code></p></td><td><p><code class="literal">"Friend 5"</code></p></td></tr></tbody></table></div>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>