<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml"><head>
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>9.2. Order by -  - The Neo4j Manual v2.2-SNAPSHOT</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1" /><link rel="prev" href="query-return.html" title="9.1. Return" /><link rel="next" href="query-limit.html" title="9.3. Limit" /><link rel="copyright" href="ln-d5e39.html" title="License: Creative Commons 3.0" /><meta name="Section-title" content="9.2. Order by" /><script type="text/javascript">
      //The id for tree cookie
      var treeCookieId = "treeview-70838";
      var language = "en";
      var w = new Object();
      //Localization
      txt_filesfound = 'Results';
      txt_enter_at_least_1_char = "You must enter at least one character.";
      txt_browser_not_supported = "JavaScript is disabled on your browser. Please enable JavaScript to enjoy all the features of this site.";
      txt_please_wait = "Please wait. Search in progress...";
      txt_results_for = "Results for: ";
    </script><meta name="viewport" content="width=device-width, initial-scale=1" /><link href="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css" rel="stylesheet" /><link rel="stylesheet" type="text/css" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/themes/redmond/jquery-ui.min.css" /><link rel="stylesheet" type="text/css" href="common/jquery/treeview/jquery.treeview.css" /><link rel="stylesheet" type="text/css" href="common/css/positioning.css" /><link rel="stylesheet" type="text/css" href="common/css/style.css" /><!--[if IE]>
  <link rel="stylesheet" type="text/css" href="../common/css/ie.css"/>
  <![endif]--><link href="//maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet" /><script type="text/javascript" src="common/browserDetect.js"></script><script src="//ajax.googleapis.com/ajax/libs/jquery/2.1.1/jquery.min.js"></script><script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.11.1/jquery-ui.min.js"></script><script type="text/javascript" src="common/jquery/jquery.highlight.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-cookie/1.4.1/jquery.cookie.min.js"></script><script type="text/javascript" src="common/jquery/treeview/jquery.treeview.min.js"></script><script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery-scrollTo/1.4.11/jquery.scrollTo.min.js"></script><script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script><script type="text/javascript" src="common/main.js"></script><script type="text/javascript" src="search/l10n.js"></script><script type="text/javascript" src="search/htmlFileInfoList.js"></script><script type="text/javascript" src="common/search.js"></script><script type="text/javascript" src="search/stemmers/en_stemmer.js"></script><script type="text/javascript" src="search/index-1.js"></script><script type="text/javascript" src="search/index-2.js"></script><script type="text/javascript" src="search/index-3.js"></script>


<!-- favicon -->

<link rel="shortcut icon" href="common/images/favicon.ico" />

<!-- fonts -->

<link href='//fonts.googleapis.com/css?family=Ubuntu+Mono|PT+Sans:400,700,400italic' rel='stylesheet' type='text/css' />

<!-- Syntax Highlighter -->

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.css" />
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/theme/neo.min.css" />
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/codemirror.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/addon/runmode/runmode.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/javascript/javascript.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/shell/shell.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/sql/sql.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/xml/xml.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/clike/clike.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/cypher/cypher.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/codemirror/4.6.0/mode/properties/properties.min.js"></script>

<script src="js/colorize.js"></script>
 
<script type="text/javascript">
  $(function (){
    CodeMirror.colorize();
  });
</script>

<!-- Cypher Console -->

<script type="text/javascript" src="js/console.js"></script>
<script type="text/javascript" src="js/cypherconsole.js"></script>

<!-- Version -->
<script type="text/javascript" src="js/version.js"></script>
<script type="text/javascript" src="js/versionswitcher.js"></script>

<!-- Discuss -->
<script type="text/javascript" src="js/mutate.min.js"></script>
<script type="text/javascript" src="js/disqus.js"></script>

<script type="text/javascript">
    /*@cc_on @*/
    /*@
     $( '#content' ).addClass( 'internet-explorer' );
     @*/
</script>


</head><body><div id="header"><a href="index.html" id="logo"><img src="common/images/logo-neo4j.svg" alt="" /></a><h1><span id="book-title">The Neo4j Manual v2.2-SNAPSHOT</span><span>9.2. Order by</span></h1><div id="navheader"><!----><div id="navLinks"><span><a id="showHideButton" href="#" class="pointLeft" tabindex="5" title="Show/Hide TOC tree"><i class="fa fa-columns"></i> Contents
            </a></span><span><a accesskey="p" id="navLinkPrevious" tabindex="5" href="query-return.html"><i class="fa fa-arrow-circle-left"></i> Prev</a></span><span><a accesskey="u" id="navLinkUp" tabindex="5" href="query-general.html">Up <i class="fa fa-arrow-circle-up"></i></a></span><span><a accesskey="n" id="navLinkNext" tabindex="5" href="query-limit.html">Next <i class="fa fa-arrow-circle-right"></i></a></span></div></div></div><div id="content"><section class="section" id="query-order"><div xmlns="" class="titlepage"><div><div><h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both">9.2. Order by</h2></div></div></div><div class="toc"><ul class="toc"><li><span class="section"><a href="query-order.html#order-by-order-nodes-by-property">Order nodes by property</a></span></li><li><span class="section"><a href="query-order.html#order-by-order-nodes-by-multiple-properties">Order nodes by multiple properties</a></span></li><li><span class="section"><a href="query-order.html#order-by-order-nodes-in-descending-order">Order nodes in descending order</a></span></li><li><span class="section"><a href="query-order.html#order-by-ordering-null">Ordering NULL</a></span></li></ul></div>

<p>To sort the output, use the <code class="literal">ORDER BY</code> clause. Note that you can not sort on nodes or relationships,
just on properties on these.
<code class="literal">ORDER BY</code> relies on comparisons to sort the output, see <a class="xref" href="query-operators.html#cypher-ordering" title="Ordering and Comparison of Values">the section called “Ordering and Comparison of Values”</a>.</p>
<div class="figure" id="d5e5752"><p class="title"><strong>Figure 9.2. Graph</strong></p><div class="figure-contents">
<a class="ulink" href="images/cypher-orderby-graph.svg" target="_blank">
<span class="inlinemediaobject"><img src="images/cypher-orderby-graph.svg" alt="cypher-orderby-graph.svg" /></span>
</a>
</div></div>
<section class="section" id="order-by-order-nodes-by-property"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Order nodes by property</h3></div></div></div>

<p><code class="literal">ORDER BY</code> is used to sort the output.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n
ORDER BY n.name</pre><p>
</p>
<p>The nodes are returned, sorted by their name.</p>
<div class="queryresult table" id="d5e5769"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr><tr><td><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:34, `length`:170, `name`:"A"})
create (_1 {`age`:34, `name`:"B"})
create (_2 {`age`:32, `length`:185, `name`:"C"})
create _0-[:`KNOWS`]-&gt;_1
create _1-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (n) return n order by n.name</strong></span></p>
</section>
<section class="section" id="order-by-order-nodes-by-multiple-properties"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Order nodes by multiple properties</h3></div></div></div>

<p>You can order by multiple properties by stating each identifier in the <code class="literal">ORDER BY</code> clause. Cypher will sort the result by the first identifier listed, and for equals values, go to the next property in the <code class="literal">ORDER BY</code> clause, and so on.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n
ORDER BY n.age, n.name</pre><p>
</p>
<p>This returns the nodes, sorted first by their age, and then by their name.</p>
<div class="queryresult table" id="d5e5807"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:34, `length`:170, `name`:"A"})
create (_1 {`age`:34, `name`:"B"})
create (_2 {`age`:32, `length`:185, `name`:"C"})
create _0-[:`KNOWS`]-&gt;_1
create _1-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (n) return n order by n.age, n.name</strong></span></p>
</section>
<section class="section" id="order-by-order-nodes-in-descending-order"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Order nodes in descending order</h3></div></div></div>

<p>By adding <code class="literal">DESC[ENDING]</code> after the identifier to sort on, the sort will be done in reverse order.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n
ORDER BY n.name DESC</pre><p>
</p>
<p>The example returns the nodes, sorted by their name reversely.</p>
<div class="queryresult table" id="d5e5844"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n</th></tr></thead><tfoot><tr><th>3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr><tr><td><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:34, `length`:170, `name`:"A"})
create (_1 {`age`:34, `name`:"B"})
create (_2 {`age`:32, `length`:185, `name`:"C"})
create _0-[:`KNOWS`]-&gt;_1
create _1-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (n) return n order by n.name DESC</strong></span></p>
</section>
<section class="section" id="order-by-ordering-null"><div xmlns="" class="titlepage"><div><div><h3 xmlns="http://www.w3.org/1999/xhtml" class="title">Ordering NULL</h3></div></div></div>

<p>When sorting the result set, <code class="literal">NULL</code> will always come at the end of the result set for ascending sorting, and first when doing descending sort.</p>
<p><strong>Query. </strong>
</p><pre class="programlisting" data-lang="cypher">MATCH (n)
RETURN n.length, n
ORDER BY n.length</pre><p>
</p>
<p>The nodes are returned sorted by the length property, with a node without that property last.</p>
<div class="queryresult table" id="d5e5881"><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table cellspacing="0" cellpadding="0"><thead><tr><th>n.length</th><th>n</th></tr></thead><tfoot><tr><th colspan="2">3 rows</th></tr></tfoot><tbody><tr><td><p><code class="literal">170</code></p></td><td><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td><p><code class="literal">185</code></p></td><td><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td><p><code class="literal">&lt;null&gt;</code></p></td><td><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr></tbody></table></div></div>
<p class="cypherconsole"><strong>Try this query live. </strong><span class="database">create (_0 {`age`:34, `length`:170, `name`:"A"})
create (_1 {`age`:34, `name`:"B"})
create (_2 {`age`:32, `length`:185, `name`:"C"})
create _0-[:`KNOWS`]-&gt;_1
create _1-[:`KNOWS`]-&gt;_2
</span><span class="command"><strong>
 match (n) return n.length, n order by n.length</strong></span></p>
</section>
</section>

 <footer>
   <p>
   © Copyright
   <a href="http://creativecommons.org/licenses/by-sa/3.0/"><img id="copyright-img" src="images/by-sa.svg" alt="CC BY-SA 3.0" title="Creative Commons Attribution-ShareAlike 3.0"></a>
   <a href="http://neo4j.com/"><img id="neotech-logo" src="images/neo-technology.svg" alt="Neo Technology"></a>
   </p>
 </footer>
  <script type="text/javascript">

    (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
    m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

    //Allow Linker
    ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
    ga('send', 'pageview');

    // Load the plugin.
    ga('require', 'linker');

    // Define which domains to autoLink.
    ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
  </script>

</div></body></html>